hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
#define	OTG_GINTSTS_ALTERNATE_CMOD_B_0X0						(0x0u<<0)
#define	OTG_GINTSTS_ALTERNATE_CMOD_B_0X1						(0x1u<<0)

// GINTMSK Configuration

#define	OTG_GINTMSK_WUIM										(0x1u<<31)
#define	OTG_GINTMSK_SRQIM										(0x1u<<30)
#define	OTG_GINTMSK_DISCINT										(0x1u<<29)
#define	OTG_GINTMSK_CIDSCHGM									(0x1u<<28)
#define	OTG_GINTMSK_LPMINTM										(0x1u<<27)
#define	OTG_GINTMSK_PTXFEM										(0x1u<<26)
#define	OTG_GINTMSK_HCIM										(0x1u<<25)
#define	OTG_GINTMSK_PRTIM										(0x1u<<24)
#define	OTG_GINTMSK_IPXFRM										(0x1u<<21)
#define	OTG_GINTMSK_NPTXFEM										(0x1u<<5)
#define	OTG_GINTMSK_RXFLVLM										(0x1u<<4)
#define	OTG_GINTMSK_SOFM										(0x1u<<3)
#define	OTG_GINTMSK_OTGINT										(0x1u<<2)
#define	OTG_GINTMSK_MMISM										(0x1u<<1)

#define	OTG_GINTMSK_WUIM_B_0X0									(0x0u<<31)
#define	OTG_GINTMSK_WUIM_B_0X1									(0x1u<<31)
#define	OTG_GINTMSK_SRQIM_B_0X0									(0x0u<<30)
#define	OTG_GINTMSK_SRQIM_B_0X1									(0x1u<<30)
#define	OTG_GINTMSK_DISCINT_B_0X0								(0x0u<<29)
#define	OTG_GINTMSK_DISCINT_B_0X1								(0x1u<<29)
#define	OTG_GINTMSK_CIDSCHGM_B_0X0								(0x0u<<28)
#define	OTG_GINTMSK_CIDSCHGM_B_0X1								(0x1u<<28)
#define	OTG_GINTMSK_LPMINTM_B_0X0								(0x0u<<27)
#define	OTG_GINTMSK_LPMINTM_B_0X1								(0x1u<<27)
#define	OTG_GINTMSK_PTXFEM_B_0X0								(0x0u<<26)
#define	OTG_GINTMSK_PTXFEM_B_0X1								(0x1u<<26)
#define	OTG_GINTMSK_HCIM_B_0X0									(0x0u<<25)
#define	OTG_GINTMSK_HCIM_B_0X1									(0x1u<<25)
#define	OTG_GINTMSK_PRTIM_B_0X0									(0x0u<<24)
#define	OTG_GINTMSK_PRTIM_B_0X1									(0x1u<<24)
#define	OTG_GINTMSK_IPXFRM_B_0X0								(0x0u<<21)
#define	OTG_GINTMSK_IPXFRM_B_0X1								(0x1u<<21)
#define	OTG_GINTMSK_NPTXFEM_B_0X0								(0x0u<<5)
#define	OTG_GINTMSK_NPTXFEM_B_0X1								(0x1u<<5)
#define	OTG_GINTMSK_RXFLVLM_B_0X0								(0x0u<<4)
#define	OTG_GINTMSK_RXFLVLM_B_0X1								(0x1u<<4)
#define	OTG_GINTMSK_SOFM_B_0X0									(0x0u<<3)
#define	OTG_GINTMSK_SOFM_B_0X1									(0x1u<<3)
#define	OTG_GINTMSK_OTGINT_B_0X0								(0x0u<<2)
#define	OTG_GINTMSK_OTGINT_B_0X1								(0x1u<<2)
#define	OTG_GINTMSK_MMISM_B_0X0									(0x0u<<1)
#define	OTG_GINTMSK_MMISM_B_0X1									(0x1u<<1)

// GINTMSK_ALTERNATE Configuration

#define	OTG_GINTMSK_ALTERNATE_WUIM								(0x1u<<31)
#define	OTG_GINTMSK_ALTERNATE_SRQIM								(0x1u<<30)
#define	OTG_GINTMSK_ALTERNATE_CIDSCHGM							(0x1u<<28)
#define	OTG_GINTMSK_ALTERNATE_LPMINTM							(0x1u<<27)
#define	OTG_GINTMSK_ALTERNATE_RSTDETM							(0x1u<<23)
#define	OTG_GINTMSK_ALTERNATE_FSUSPM							(0x1u<<22)
#define	OTG_GINTMSK_ALTERNATE_IISOOXFRM							(0x1u<<21)
#define	OTG_GINTMSK_ALTERNATE_IISOIXFRM							(0x1u<<20)
#define	OTG_GINTMSK_ALTERNATE_OEPINT							(0x1u<<19)
#define	OTG_GINTMSK_ALTERNATE_IEPINT							(0x1u<<18)
#define	OTG_GINTMSK_ALTERNATE_EOPFM								(0x1u<<15)
#define	OTG_GINTMSK_ALTERNATE_ISOODRPM							(0x1u<<14)
#define	OTG_GINTMSK_ALTERNATE_ENUMDNEM							(0x1u<<13)
#define	OTG_GINTMSK_ALTERNATE_USBRST							(0x1u<<12)
#define	OTG_GINTMSK_ALTERNATE_USBSUSPM							(0x1u<<11)
#define	OTG_GINTMSK_ALTERNATE_ESUSPM							(0x1u<<10)
#define	OTG_GINTMSK_ALTERNATE_GONAKEFFM							(0x1u<<7)
#define	OTG_GINTMSK_ALTERNATE_GINAKEFFM							(0x1u<<6)
#define	OTG_GINTMSK_ALTERNATE_RXFLVLM							(0x1u<<4)
#define	OTG_GINTMSK_ALTERNATE_SOFM								(0x1u<<3)
#define	OTG_GINTMSK_ALTERNATE_OTGINT							(0x1u<<2)
#define	OTG_GINTMSK_ALTERNATE_MMISM								(0x1u<<1)

#define	OTG_GINTMSK_ALTERNATE_WUIM_B_0X0						(0x0u<<31)
#define	OTG_GINTMSK_ALTERNATE_WUIM_B_0X1						(0x1u<<31)
#define	OTG_GINTMSK_ALTERNATE_SRQIM_B_0X0						(0x0u<<30)
#define	OTG_GINTMSK_ALTERNATE_SRQIM_B_0X1						(0x1u<<30)
#define	OTG_GINTMSK_ALTERNATE_CIDSCHGM_B_0X0					(0x0u<<28)
#define	OTG_GINTMSK_ALTERNATE_CIDSCHGM_B_0X1					(0x1u<<28)
#define	OTG_GINTMSK_ALTERNATE_LPMINTM_B_0X0						(0x0u<<27)
#define	OTG_GINTMSK_ALTERNATE_LPMINTM_B_0X1						(0x1u<<27)
#define	OTG_GINTMSK_ALTERNATE_RSTDETM_B_0X0						(0x0u<<23)
#define	OTG_GINTMSK_ALTERNATE_RSTDETM_B_0X1						(0x1u<<23)
#define	OTG_GINTMSK_ALTERNATE_FSUSPM_B_0X0						(0x0u<<22)
#define	OTG_GINTMSK_ALTERNATE_FSUSPM_B_0X1						(0x1u<<22)
#define	OTG_GINTMSK_ALTERNATE_IISOOXFRM_B_0X0					(0x0u<<21)
#define	OTG_GINTMSK_ALTERNATE_IISOOXFRM_B_0X1					(0x1u<<21)
#define	OTG_GINTMSK_ALTERNATE_IISOIXFRM_B_0X0					(0x0u<<20)
#define	OTG_GINTMSK_ALTERNATE_IISOIXFRM_B_0X1					(0x1u<<20)
#define	OTG_GINTMSK_ALTERNATE_OEPINT_B_0X0						(0x0u<<19)
#define	OTG_GINTMSK_ALTERNATE_OEPINT_B_0X1						(0x1u<<19)
#define	OTG_GINTMSK_ALTERNATE_IEPINT_B_0X0						(0x0u<<18)
#define	OTG_GINTMSK_ALTERNATE_IEPINT_B_0X1						(0x1u<<18)
#define	OTG_GINTMSK_ALTERNATE_EOPFM_B_0X0						(0x0u<<15)
#define	OTG_GINTMSK_ALTERNATE_EOPFM_B_0X1						(0x1u<<15)
#define	OTG_GINTMSK_ALTERNATE_ISOODRPM_B_0X0					(0x0u<<14)
#define	OTG_GINTMSK_ALTERNATE_ISOODRPM_B_0X1					(0x1u<<14)
#define	OTG_GINTMSK_ALTERNATE_ENUMDNEM_B_0X0					(0x0u<<13)
#define	OTG_GINTMSK_ALTERNATE_ENUMDNEM_B_0X1					(0x1u<<13)
#define	OTG_GINTMSK_ALTERNATE_USBRST_B_0X0						(0x0u<<12)
#define	OTG_GINTMSK_ALTERNATE_USBRST_B_0X1						(0x1u<<12)
#define	OTG_GINTMSK_ALTERNATE_USBSUSPM_B_0X0					(0x0u<<11)
#define	OTG_GINTMSK_ALTERNATE_USBSUSPM_B_0X1					(0x1u<<11)
#define	OTG_GINTMSK_ALTERNATE_ESUSPM_B_0X0						(0x0u<<10)
#define	OTG_GINTMSK_ALTERNATE_ESUSPM_B_0X1						(0x1u<<10)
#define	OTG_GINTMSK_ALTERNATE_GONAKEFFM_B_0X0					(0x0u<<7)
#define	OTG_GINTMSK_ALTERNATE_GONAKEFFM_B_0X1					(0x1u<<7)
#define	OTG_GINTMSK_ALTERNATE_GINAKEFFM_B_0X0					(0x0u<<6)
#define	OTG_GINTMSK_ALTERNATE_GINAKEFFM_B_0X1					(0x1u<<6)
#define	OTG_GINTMSK_ALTERNATE_RXFLVLM_B_0X0						(0x0u<<4)
#define	OTG_GINTMSK_ALTERNATE_RXFLVLM_B_0X1						(0x1u<<4)
#define	OTG_GINTMSK_ALTERNATE_SOFM_B_0X0						(0x0u<<3)
#define	OTG_GINTMSK_ALTERNATE_SOFM_B_0X1						(0x1u<<3)
#define	OTG_GINTMSK_ALTERNATE_OTGINT_B_0X0						(0x0u<<2)
#define	OTG_GINTMSK_ALTERNATE_OTGINT_B_0X1						(0x1u<<2)
#define	OTG_GINTMSK_ALTERNATE_MMISM_B_0X0						(0x0u<<1)
#define	OTG_GINTMSK_ALTERNATE_MMISM_B_0X1						(0x1u<<1)

