hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
// GRXSTSR Configuration

#define	OTG_GRXSTSR_STSPHST										(0x1u<<27)
#define	OTG_GRXSTSR_FRMNUM										(0xFu<<21)
#define	OTG_GRXSTSR_FRMNUM_0									(0x1u<<21)
#define	OTG_GRXSTSR_PKTSTS										(0xFu<<17)
#define	OTG_GRXSTSR_PKTSTS_0									(0x1u<<17)
#define	OTG_GRXSTSR_DPID										(0x3u<<15)
#define	OTG_GRXSTSR_DPID_0										(0x1u<<15)
#define	OTG_GRXSTSR_BCNT										(0x7FFu<<4)
#define	OTG_GRXSTSR_BCNT_0										(0x1u<<4)
#define	OTG_GRXSTSR_EPNUM										(0xFu<<0)
#define	OTG_GRXSTSR_EPNUM_0										(0x1u<<0)

#define	OTG_GRXSTSR_PKTSTS_B_0X1								(0x1u<<17)
#define	OTG_GRXSTSR_PKTSTS_B_0X2								(0x2u<<17)
#define	OTG_GRXSTSR_PKTSTS_B_0X3								(0x3u<<17)
#define	OTG_GRXSTSR_PKTSTS_B_0X4								(0x4u<<17)
#define	OTG_GRXSTSR_PKTSTS_B_0X6								(0x6u<<17)
#define	OTG_GRXSTSR_DPID_B_0X0									(0x0u<<15)
#define	OTG_GRXSTSR_DPID_B_0X2									(0x2u<<15)
#define	OTG_GRXSTSR_DPID_B_0X1									(0x1u<<15)
#define	OTG_GRXSTSR_DPID_B_0X3									(0x3u<<15)

// GRXSTSR_ALTERNATE Configuration

#define	OTG_GRXSTSR_ALTERNATE_PKTSTS							(0xFu<<17)
#define	OTG_GRXSTSR_ALTERNATE_PKTSTS_0							(0x1u<<17)
#define	OTG_GRXSTSR_ALTERNATE_DPID								(0x3u<<15)
#define	OTG_GRXSTSR_ALTERNATE_DPID_0							(0x1u<<15)
#define	OTG_GRXSTSR_ALTERNATE_BCNT								(0x7FFu<<4)
#define	OTG_GRXSTSR_ALTERNATE_BCNT_0							(0x1u<<4)
#define	OTG_GRXSTSR_ALTERNATE_CHNUM								(0xFu<<0)
#define	OTG_GRXSTSR_ALTERNATE_CHNUM_0							(0x1u<<0)

#define	OTG_GRXSTSR_ALTERNATE_PKTSTS_B_0X2						(0x2u<<17)
#define	OTG_GRXSTSR_ALTERNATE_PKTSTS_B_0X3						(0x3u<<17)
#define	OTG_GRXSTSR_ALTERNATE_PKTSTS_B_0X5						(0x5u<<17)
#define	OTG_GRXSTSR_ALTERNATE_PKTSTS_B_0X7						(0x7u<<17)
#define	OTG_GRXSTSR_ALTERNATE_DPID_B_0X0						(0x0u<<15)
#define	OTG_GRXSTSR_ALTERNATE_DPID_B_0X2						(0x2u<<15)
#define	OTG_GRXSTSR_ALTERNATE_DPID_B_0X1						(0x1u<<15)
#define	OTG_GRXSTSR_ALTERNATE_DPID_B_0X3						(0x3u<<15)

// GRXSTSP Configuration

#define	OTG_GRXSTSP_STSPHST										(0x1u<<27)
#define	OTG_GRXSTSP_FRMNUM										(0xFu<<21)
#define	OTG_GRXSTSP_FRMNUM_0									(0x1u<<21)
#define	OTG_GRXSTSP_PKTSTS										(0xFu<<17)
#define	OTG_GRXSTSP_PKTSTS_0									(0x1u<<17)
#define	OTG_GRXSTSP_DPID										(0x3u<<15)
#define	OTG_GRXSTSP_DPID_0										(0x1u<<15)
#define	OTG_GRXSTSP_BCNT										(0x7FFu<<4)
#define	OTG_GRXSTSP_BCNT_0										(0x1u<<4)
#define	OTG_GRXSTSP_EPNUM										(0xFu<<0)
#define	OTG_GRXSTSP_EPNUM_0										(0x1u<<0)

#define	OTG_GRXSTSP_PKTSTS_B_0X1								(0x1u<<17)
#define	OTG_GRXSTSP_PKTSTS_B_0X2								(0x2u<<17)
#define	OTG_GRXSTSP_PKTSTS_B_0X3								(0x3u<<17)
#define	OTG_GRXSTSP_PKTSTS_B_0X4								(0x4u<<17)
#define	OTG_GRXSTSP_PKTSTS_B_0X6								(0x6u<<17)
#define	OTG_GRXSTSP_DPID_B_0X0									(0x0u<<15)
#define	OTG_GRXSTSP_DPID_B_0X2									(0x2u<<15)
#define	OTG_GRXSTSP_DPID_B_0X1									(0x1u<<15)
#define	OTG_GRXSTSP_DPID_B_0X3									(0x3u<<15)

// GRXSTSP_ALTERNATE Configuration

#define	OTG_GRXSTSP_ALTERNATE_PKTSTS							(0xFu<<17)
#define	OTG_GRXSTSP_ALTERNATE_PKTSTS_0							(0x1u<<17)
#define	OTG_GRXSTSP_ALTERNATE_DPID								(0x3u<<15)
#define	OTG_GRXSTSP_ALTERNATE_DPID_0							(0x1u<<15)
#define	OTG_GRXSTSP_ALTERNATE_BCNT								(0x7FFu<<4)
#define	OTG_GRXSTSP_ALTERNATE_BCNT_0							(0x1u<<4)
#define	OTG_GRXSTSP_ALTERNATE_CHNUM								(0xFu<<0)
#define	OTG_GRXSTSP_ALTERNATE_CHNUM_0							(0x1u<<0)

#define	OTG_GRXSTSP_ALTERNATE_PKTSTS_B_0X2						(0x2u<<17)
#define	OTG_GRXSTSP_ALTERNATE_PKTSTS_B_0X3						(0x3u<<17)
#define	OTG_GRXSTSP_ALTERNATE_PKTSTS_B_0X5						(0x5u<<17)
#define	OTG_GRXSTSP_ALTERNATE_PKTSTS_B_0X7						(0x7u<<17)
#define	OTG_GRXSTSP_ALTERNATE_DPID_B_0X0						(0x0u<<15)
#define	OTG_GRXSTSP_ALTERNATE_DPID_B_0X2						(0x2u<<15)
#define	OTG_GRXSTSP_ALTERNATE_DPID_B_0X1						(0x1u<<15)
#define	OTG_GRXSTSP_ALTERNATE_DPID_B_0X3						(0x3u<<15)

// GRXFSIZ Configuration

#define	OTG_GRXFSIZ_RXFD										(0xFFFFu<<0)
#define	OTG_GRXFSIZ_RXFD_0										(0x1u<<0)

// HNPTXFSIZ Configuration

#define	OTG_HNPTXFSIZ_NPTXFD									(0xFFFFu<<16)
#define	OTG_HNPTXFSIZ_NPTXFD_0									(0x1u<<16)
#define	OTG_HNPTXFSIZ_NPTXFSA									(0xFFFFu<<0)
#define	OTG_HNPTXFSIZ_NPTXFSA_0									(0x1u<<0)

// HNPTXFSIZ_ALTERNATE Configuration

#define	OTG_HNPTXFSIZ_ALTERNATE_TX0FD							(0xFFFFu<<16)
#define	OTG_HNPTXFSIZ_ALTERNATE_TX0FD_0							(0x1u<<16)
#define	OTG_HNPTXFSIZ_ALTERNATE_TX0FSA							(0xFFFFu<<0)
#define	OTG_HNPTXFSIZ_ALTERNATE_TX0FSA_0						(0x1u<<0)

// HNPTXSTS Configuration

#define	OTG_HNPTXSTS_NPTXQTOP									(0x7Fu<<24)
#define	OTG_HNPTXSTS_NPTXQTOP_0									(0x1u<<24)
#define	OTG_HNPTXSTS_NPTQXSAV									(0xFFu<<16)
#define	OTG_HNPTXSTS_NPTQXSAV_0									(0x1u<<16)
#define	OTG_HNPTXSTS_NPTXFSAV									(0xFFFFu<<0)
#define	OTG_HNPTXSTS_NPTXFSAV_0									(0x1u<<0)

#define	OTG_HNPTXSTS_NPTQXSAV_B_0X0								(0x0u<<16)
#define	OTG_HNPTXSTS_NPTQXSAV_B_0X1								(0x1u<<16)
#define	OTG_HNPTXSTS_NPTXFSAV_B_0X0								(0x0u<<0)
#define	OTG_HNPTXSTS_NPTXFSAV_B_0X1								(0x1u<<0)

// GCCFG Configuration

#define	OTG_GCCFG_IDPULLUPDIS									(0x1u<<28)
#define	OTG_GCCFG_BCDEN											(0x1u<<26)
#define	OTG_GCCFG_FORCEHOSTPD									(0x1u<<25)
#define	OTG_GCCFG_VBVALOVAL										(0x1u<<23)
#define	OTG_GCCFG_SDEN											(0x1u<<22)
#define	OTG_GCCFG_PDEN											(0x1u<<20)
#define	OTG_GCCFG_DCDEN											(0x1u<<19)
#define	OTG_GCCFG_HVDMSRCEN										(0x1u<<18)
#define	OTG_GCCFG_HCDPDETEN										(0x1u<<17)
#define	OTG_GCCFG_HCDPEN										(0x1u<<16)
#define	OTG_GCCFG_VBUSVLD										(0x1u<<4)
#define	OTG_GCCFG_SESSVLD										(0x1u<<3)
#define	OTG_GCCFG_FSVMINUS										(0x1u<<2)
#define	OTG_GCCFG_FSVPLUS										(0x1u<<1)
#define	OTG_GCCFG_CHGDET										(0x1u<<0)

#define	OTG_GCCFG_IDPULLUPDIS_B_0X0								(0x0u<<28)
#define	OTG_GCCFG_IDPULLUPDIS_B_0X1								(0x1u<<28)
#define	OTG_GCCFG_BCDEN_B_0X0									(0x0u<<26)
#define	OTG_GCCFG_BCDEN_B_0X1									(0x1u<<26)
#define	OTG_GCCFG_FORCEHOSTPD_B_0X0								(0x0u<<25)
#define	OTG_GCCFG_FORCEHOSTPD_B_0X1								(0x1u<<25)
#define	OTG_GCCFG_VBVALOVAL_B_0X0								(0x0u<<23)
#define	OTG_GCCFG_VBVALOVAL_B_0X1								(0x1u<<23)
#define	OTG_GCCFG_SDEN_B_0X0									(0x0u<<22)
#define	OTG_GCCFG_SDEN_B_0X1									(0x1u<<22)
#define	OTG_GCCFG_PDEN_B_0X0									(0x0u<<20)
#define	OTG_GCCFG_PDEN_B_0X1									(0x1u<<20)
#define	OTG_GCCFG_DCDEN_B_0X0									(0x0u<<19)
#define	OTG_GCCFG_DCDEN_B_0X1									(0x1u<<19)
#define	OTG_GCCFG_HVDMSRCEN_B_0X0								(0x0u<<18)
#define	OTG_GCCFG_HVDMSRCEN_B_0X1								(0x1u<<18)
#define	OTG_GCCFG_HCDPDETEN_B_0X0								(0x0u<<17)
#define	OTG_GCCFG_HCDPDETEN_B_0X1								(0x1u<<17)
#define	OTG_GCCFG_HCDPEN_B_0X0									(0x0u<<16)
#define	OTG_GCCFG_HCDPEN_B_0X1									(0x1u<<16)
#define	OTG_GCCFG_VBUSVLD_B_0X0									(0x0u<<4)
#define	OTG_GCCFG_VBUSVLD_B_0X1									(0x1u<<4)
#define	OTG_GCCFG_SESSVLD_B_0X0									(0x0u<<3)
#define	OTG_GCCFG_SESSVLD_B_0X1									(0x1u<<3)
#define	OTG_GCCFG_FSVMINUS_B_0X0								(0x0u<<2)
#define	OTG_GCCFG_FSVMINUS_B_0X1								(0x1u<<2)
#define	OTG_GCCFG_FSVPLUS_B_0X0									(0x0u<<1)
#define	OTG_GCCFG_FSVPLUS_B_0X1									(0x1u<<1)
#define	OTG_GCCFG_CHGDET_B_0X0									(0x0u<<0)
#define	OTG_GCCFG_CHGDET_B_0X1									(0x1u<<0)

// CID Configuration

#define	OTG_CID_PRODUCT_ID										(0xFFFFFFFFu<<0)
#define	OTG_CID_PRODUCT_ID_0									(0x1u<<0)

