hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
// GLPMCFG Configuration

#define	OTG_GLPMCFG_ENBESL										(0x1u<<28)
#define	OTG_GLPMCFG_LPMRCNTSTS									(0x7u<<25)
#define	OTG_GLPMCFG_LPMRCNTSTS_0								(0x1u<<25)
#define	OTG_GLPMCFG_SNDLPM										(0x1u<<24)
#define	OTG_GLPMCFG_LPMRCNT										(0x7u<<21)
#define	OTG_GLPMCFG_LPMRCNT_0									(0x1u<<21)
#define	OTG_GLPMCFG_LPMCHIDX									(0xFu<<17)
#define	OTG_GLPMCFG_LPMCHIDX_0									(0x1u<<17)
#define	OTG_GLPMCFG_L1RSMOK										(0x1u<<16)
#define	OTG_GLPMCFG_SLPSTS										(0x1u<<15)
#define	OTG_GLPMCFG_LPMRSP										(0x3u<<13)
#define	OTG_GLPMCFG_LPMRSP_0									(0x1u<<13)
#define	OTG_GLPMCFG_L1DSEN										(0x1u<<12)
#define	OTG_GLPMCFG_BESLTHRS									(0xFu<<8)
#define	OTG_GLPMCFG_BESLTHRS_0									(0x1u<<8)
#define	OTG_GLPMCFG_L1SSEN										(0x1u<<7)
#define	OTG_GLPMCFG_REMWAKE										(0x1u<<6)
#define	OTG_GLPMCFG_BESL										(0xFu<<2)
#define	OTG_GLPMCFG_BESL_0										(0x1u<<2)
#define	OTG_GLPMCFG_LPMACK										(0x1u<<1)
#define	OTG_GLPMCFG_LPMEN										(0x1u<<0)

#define	OTG_GLPMCFG_ENBESL_B_0X0								(0x0u<<28)
#define	OTG_GLPMCFG_ENBESL_B_0X1								(0x1u<<28)
#define	OTG_GLPMCFG_L1RSMOK_B_0X1								(0x1u<<16)
#define	OTG_GLPMCFG_L1RSMOK_B_0X0								(0x0u<<16)
#define	OTG_GLPMCFG_SLPSTS_B_0X0								(0x0u<<15)
#define	OTG_GLPMCFG_SLPSTS_B_0X1								(0x1u<<15)
#define	OTG_GLPMCFG_LPMRSP_B_0X3								(0x3u<<13)
#define	OTG_GLPMCFG_LPMRSP_B_0X2								(0x2u<<13)
#define	OTG_GLPMCFG_LPMRSP_B_0X1								(0x1u<<13)
#define	OTG_GLPMCFG_LPMRSP_B_0X0								(0x0u<<13)
#define	OTG_GLPMCFG_BESLTHRS_B_0X0								(0x0u<<8)
#define	OTG_GLPMCFG_BESLTHRS_B_0X1								(0x1u<<8)
#define	OTG_GLPMCFG_BESLTHRS_B_0X2								(0x2u<<8)
#define	OTG_GLPMCFG_BESLTHRS_B_0X3								(0x3u<<8)
#define	OTG_GLPMCFG_BESLTHRS_B_0X4								(0x4u<<8)
#define	OTG_GLPMCFG_BESLTHRS_B_0X5								(0x5u<<8)
#define	OTG_GLPMCFG_BESLTHRS_B_0X6								(0x6u<<8)
#define	OTG_GLPMCFG_BESL_B_0X0									(0x0u<<2)
#define	OTG_GLPMCFG_BESL_B_0X1									(0x1u<<2)
#define	OTG_GLPMCFG_BESL_B_0X2									(0x2u<<2)
#define	OTG_GLPMCFG_BESL_B_0X3									(0x3u<<2)
#define	OTG_GLPMCFG_BESL_B_0X4									(0x4u<<2)
#define	OTG_GLPMCFG_BESL_B_0X5									(0x5u<<2)
#define	OTG_GLPMCFG_BESL_B_0X6									(0x6u<<2)
#define	OTG_GLPMCFG_BESL_B_0X7									(0x7u<<2)
#define	OTG_GLPMCFG_BESL_B_0X8									(0x8u<<2)
#define	OTG_GLPMCFG_BESL_B_0X9									(0x9u<<2)
#define	OTG_GLPMCFG_BESL_B_0XA									(0xAu<<2)
#define	OTG_GLPMCFG_BESL_B_0XB									(0xBu<<2)
#define	OTG_GLPMCFG_BESL_B_0XC									(0xCu<<2)
#define	OTG_GLPMCFG_BESL_B_0XD									(0xDu<<2)
#define	OTG_GLPMCFG_BESL_B_0XE									(0xEu<<2)
#define	OTG_GLPMCFG_BESL_B_0XF									(0xFu<<2)
#define	OTG_GLPMCFG_LPMACK_B_0X1								(0x1u<<1)
#define	OTG_GLPMCFG_LPMACK_B_0X0								(0x0u<<1)
#define	OTG_GLPMCFG_LPMEN_B_0X0									(0x0u<<0)
#define	OTG_GLPMCFG_LPMEN_B_0X1									(0x1u<<0)

// HPTXFSIZ Configuration

#define	OTG_HPTXFSIZ_PTXFSIZ									(0xFFFFu<<16)
#define	OTG_HPTXFSIZ_PTXFSIZ_0									(0x1u<<16)
#define	OTG_HPTXFSIZ_PTXSA										(0xFFFFu<<0)
#define	OTG_HPTXFSIZ_PTXSA_0									(0x1u<<0)

// DIEPTXF1 Configuration

#define	OTG_DIEPTXF1_INEPTXFD									(0xFFFFu<<16)
#define	OTG_DIEPTXF1_INEPTXFD_0									(0x1u<<16)
#define	OTG_DIEPTXF1_INEPTXSA									(0xFFFFu<<0)
#define	OTG_DIEPTXF1_INEPTXSA_0									(0x1u<<0)

// DIEPTXF2 Configuration

#define	OTG_DIEPTXF2_INEPTXFD									(0xFFFFu<<16)
#define	OTG_DIEPTXF2_INEPTXFD_0									(0x1u<<16)
#define	OTG_DIEPTXF2_INEPTXSA									(0xFFFFu<<0)
#define	OTG_DIEPTXF2_INEPTXSA_0									(0x1u<<0)

// DIEPTXF3 Configuration

#define	OTG_DIEPTXF3_INEPTXFD									(0xFFFFu<<16)
#define	OTG_DIEPTXF3_INEPTXFD_0									(0x1u<<16)
#define	OTG_DIEPTXF3_INEPTXSA									(0xFFFFu<<0)
#define	OTG_DIEPTXF3_INEPTXSA_0									(0x1u<<0)

// DIEPTXF4 Configuration

#define	OTG_DIEPTXF4_INEPTXFD									(0xFFFFu<<16)
#define	OTG_DIEPTXF4_INEPTXFD_0									(0x1u<<16)
#define	OTG_DIEPTXF4_INEPTXSA									(0xFFFFu<<0)
#define	OTG_DIEPTXF4_INEPTXSA_0									(0x1u<<0)

// DIEPTXF5 Configuration

#define	OTG_DIEPTXF5_INEPTXFD									(0xFFFFu<<16)
#define	OTG_DIEPTXF5_INEPTXFD_0									(0x1u<<16)
#define	OTG_DIEPTXF5_INEPTXSA									(0xFFFFu<<0)
#define	OTG_DIEPTXF5_INEPTXSA_0									(0x1u<<0)

// DIEPTXF6 Configuration

#define	OTG_DIEPTXF6_INEPTXFD									(0xFFFFu<<16)
#define	OTG_DIEPTXF6_INEPTXFD_0									(0x1u<<16)
#define	OTG_DIEPTXF6_INEPTXSA									(0xFFFFu<<0)
#define	OTG_DIEPTXF6_INEPTXSA_0									(0x1u<<0)

// DIEPTXF7 Configuration

#define	OTG_DIEPTXF7_INEPTXFD									(0xFFFFu<<16)
#define	OTG_DIEPTXF7_INEPTXFD_0									(0x1u<<16)
#define	OTG_DIEPTXF7_INEPTXSA									(0xFFFFu<<0)
#define	OTG_DIEPTXF7_INEPTXSA_0									(0x1u<<0)

// DIEPTXF8 Configuration

#define	OTG_DIEPTXF8_INEPTXFD									(0xFFFFu<<16)
#define	OTG_DIEPTXF8_INEPTXFD_0									(0x1u<<16)
#define	OTG_DIEPTXF8_INEPTXSA									(0xFFFFu<<0)
#define	OTG_DIEPTXF8_INEPTXSA_0									(0x1u<<0)

// HCFG Configuration

#define	OTG_HCFG_FSLSS											(0x1u<<2)
#define	OTG_HCFG_FSLSPCS										(0x3u<<0)
#define	OTG_HCFG_FSLSPCS_0										(0x1u<<0)

#define	OTG_HCFG_FSLSPCS_B_0X1_FS_HOST_MODE						(0x1u<<0)
#define	OTG_HCFG_FSLSPCS_B_0X2_LS_HOST_MODE						(0x2u<<0)

// HFIR Configuration

#define	OTG_HFIR_RLDCTRL										(0x1u<<16)
#define	OTG_HFIR_FRIVL											(0xFFFFu<<0)
#define	OTG_HFIR_FRIVL_0										(0x1u<<0)

#define	OTG_HFIR_RLDCTRL_B_0X0									(0x0u<<16)
#define	OTG_HFIR_RLDCTRL_B_0X1									(0x1u<<16)

// HFNUM Configuration

#define	OTG_HFNUM_FTREM											(0xFFFFu<<16)
#define	OTG_HFNUM_FTREM_0										(0x1u<<16)
#define	OTG_HFNUM_FRNUM											(0xFFFFu<<0)
#define	OTG_HFNUM_FRNUM_0										(0x1u<<0)

// HPTXSTS Configuration

#define	OTG_HPTXSTS_PTXQTOP										(0xFFu<<24)
#define	OTG_HPTXSTS_PTXQTOP_0									(0x1u<<24)
#define	OTG_HPTXSTS_PTXQSAV										(0xFFu<<16)
#define	OTG_HPTXSTS_PTXQSAV_0									(0x1u<<16)
#define	OTG_HPTXSTS_PTXFSAVL									(0xFFFFu<<0)
#define	OTG_HPTXSTS_PTXFSAVL_0									(0x1u<<0)

