hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
#define	OTG_HPTXSTS_PTXQSAV_B_0X0								(0x0u<<16)
#define	OTG_HPTXSTS_PTXQSAV_B_0X1								(0x1u<<16)
#define	OTG_HPTXSTS_PTXFSAVL_B_0X0								(0x0u<<0)
#define	OTG_HPTXSTS_PTXFSAVL_B_0X1								(0x1u<<0)

// HAINT Configuration

#define	OTG_HAINT_HAINT											(0xFFFFu<<0)
#define	OTG_HAINT_HAINT_0										(0x1u<<0)

// HAINTMSK Configuration

#define	OTG_HAINTMSK_HAINTM										(0xFFFFu<<0)
#define	OTG_HAINTMSK_HAINTM_0									(0x1u<<0)

#define	OTG_HAINTMSK_HAINTM_B_0X0								(0x0u<<0)
#define	OTG_HAINTMSK_HAINTM_B_0X1								(0x1u<<0)

// HPRT Configuration

#define	OTG_HPRT_PSPD											(0x3u<<17)
#define	OTG_HPRT_PSPD_0											(0x1u<<17)
#define	OTG_HPRT_PTCTL											(0xFu<<13)
#define	OTG_HPRT_PTCTL_0										(0x1u<<13)
#define	OTG_HPRT_PPWR											(0x1u<<12)
#define	OTG_HPRT_PLSTS											(0x3u<<10)
#define	OTG_HPRT_PLSTS_0										(0x1u<<10)
#define	OTG_HPRT_PRST											(0x1u<<8)
#define	OTG_HPRT_PSUSP											(0x1u<<7)
#define	OTG_HPRT_PRES											(0x1u<<6)
#define	OTG_HPRT_POCCHNG										(0x1u<<5)
#define	OTG_HPRT_POCA											(0x1u<<4)
#define	OTG_HPRT_PENCHNG										(0x1u<<3)
#define	OTG_HPRT_PENA											(0x1u<<2)
#define	OTG_HPRT_PCDET											(0x1u<<1)
#define	OTG_HPRT_PCSTS											(0x1u<<0)

#define	OTG_HPRT_PSPD_B_0X1										(0x1u<<17)
#define	OTG_HPRT_PSPD_B_0X2										(0x2u<<17)
#define	OTG_HPRT_PSPD_B_0X0										(0x0u<<17)
#define	OTG_HPRT_PTCTL_B_0X0									(0x0u<<13)
#define	OTG_HPRT_PTCTL_B_0X1									(0x1u<<13)
#define	OTG_HPRT_PTCTL_B_0X2									(0x2u<<13)
#define	OTG_HPRT_PTCTL_B_0X3									(0x3u<<13)
#define	OTG_HPRT_PTCTL_B_0X4									(0x4u<<13)
#define	OTG_HPRT_PTCTL_B_0X5									(0x5u<<13)
#define	OTG_HPRT_PPWR_B_0X0										(0x0u<<12)
#define	OTG_HPRT_PPWR_B_0X1										(0x1u<<12)
#define	OTG_HPRT_PRST_B_0X0										(0x0u<<8)
#define	OTG_HPRT_PRST_B_0X1										(0x1u<<8)
#define	OTG_HPRT_PSUSP_B_0X0									(0x0u<<7)
#define	OTG_HPRT_PSUSP_B_0X1									(0x1u<<7)
#define	OTG_HPRT_PRES_B_0X0										(0x0u<<6)
#define	OTG_HPRT_PRES_B_0X1										(0x1u<<6)
#define	OTG_HPRT_POCA_B_0X0										(0x0u<<4)
#define	OTG_HPRT_POCA_B_0X1										(0x1u<<4)
#define	OTG_HPRT_PENA_B_0X0										(0x0u<<2)
#define	OTG_HPRT_PENA_B_0X1										(0x1u<<2)
#define	OTG_HPRT_PCSTS_B_0X0									(0x0u<<0)
#define	OTG_HPRT_PCSTS_B_0X1									(0x1u<<0)

// HCCHAR0 Configuration

#define	OTG_HCCHAR0_CHENA										(0x1u<<31)
#define	OTG_HCCHAR0_CHDIS										(0x1u<<30)
#define	OTG_HCCHAR0_ODDFRM										(0x1u<<29)
#define	OTG_HCCHAR0_DAD											(0x7Fu<<22)
#define	OTG_HCCHAR0_DAD_0										(0x1u<<22)
#define	OTG_HCCHAR0_MCNT										(0x3u<<20)
#define	OTG_HCCHAR0_MCNT_0										(0x1u<<20)
#define	OTG_HCCHAR0_EPTYP										(0x3u<<18)
#define	OTG_HCCHAR0_EPTYP_0										(0x1u<<18)
#define	OTG_HCCHAR0_LSDEV										(0x1u<<17)
#define	OTG_HCCHAR0_EPDIR										(0x1u<<15)
#define	OTG_HCCHAR0_EPNUM										(0xFu<<11)
#define	OTG_HCCHAR0_EPNUM_0										(0x1u<<11)
#define	OTG_HCCHAR0_MPSIZ										(0x7FFu<<0)
#define	OTG_HCCHAR0_MPSIZ_0										(0x1u<<0)

#define	OTG_HCCHAR0_CHENA_B_0X0									(0x0u<<31)
#define	OTG_HCCHAR0_CHENA_B_0X1									(0x1u<<31)
#define	OTG_HCCHAR0_ODDFRM_B_0X0								(0x0u<<29)
#define	OTG_HCCHAR0_ODDFRM_B_0X1								(0x1u<<29)
#define	OTG_HCCHAR0_MCNT_B_0X1									(0x1u<<20)
#define	OTG_HCCHAR0_MCNT_B_0X2									(0x2u<<20)
#define	OTG_HCCHAR0_MCNT_B_0X3									(0x3u<<20)
#define	OTG_HCCHAR0_EPTYP_B_0X0									(0x0u<<18)
#define	OTG_HCCHAR0_EPTYP_B_0X1									(0x1u<<18)
#define	OTG_HCCHAR0_EPTYP_B_0X2									(0x2u<<18)
#define	OTG_HCCHAR0_EPTYP_B_0X3									(0x3u<<18)
#define	OTG_HCCHAR0_EPDIR_B_0X0									(0x0u<<15)
#define	OTG_HCCHAR0_EPDIR_B_0X1									(0x1u<<15)

// HCSPLT0 Configuration

#define	OTG_HCSPLT0_SPLITEN										(0x1u<<31)
#define	OTG_HCSPLT0_COMPLSPLT									(0x1u<<16)
#define	OTG_HCSPLT0_XACTPOS										(0x3u<<14)
#define	OTG_HCSPLT0_XACTPOS_0									(0x1u<<14)
#define	OTG_HCSPLT0_HUBADDR										(0x7Fu<<7)
#define	OTG_HCSPLT0_HUBADDR_0									(0x1u<<7)
#define	OTG_HCSPLT0_PRTADDR										(0x7Fu<<0)
#define	OTG_HCSPLT0_PRTADDR_0									(0x1u<<0)

#define	OTG_HCSPLT0_XACTPOS_B_0X3								(0x3u<<14)
#define	OTG_HCSPLT0_XACTPOS_B_0X2								(0x2u<<14)
#define	OTG_HCSPLT0_XACTPOS_B_0X0								(0x0u<<14)
#define	OTG_HCSPLT0_XACTPOS_B_0X1								(0x1u<<14)

// HCINT0 Configuration

#define	OTG_HCINT0_DTERR										(0x1u<<10)
#define	OTG_HCINT0_FRMOR										(0x1u<<9)
#define	OTG_HCINT0_BBERR										(0x1u<<8)
#define	OTG_HCINT0_TXERR										(0x1u<<7)
#define	OTG_HCINT0_NYET											(0x1u<<6)
#define	OTG_HCINT0_ACK											(0x1u<<5)
#define	OTG_HCINT0_NAK											(0x1u<<4)
#define	OTG_HCINT0_STALL										(0x1u<<3)
#define	OTG_HCINT0_AHBERR										(0x1u<<2)
#define	OTG_HCINT0_CHH											(0x1u<<1)
#define	OTG_HCINT0_XFRC											(0x1u<<0)

// HCINTMSK0 Configuration

#define	OTG_HCINTMSK0_DTERRM									(0x1u<<10)
#define	OTG_HCINTMSK0_FRMORM									(0x1u<<9)
#define	OTG_HCINTMSK0_BBERRM									(0x1u<<8)
#define	OTG_HCINTMSK0_TXERRM									(0x1u<<7)
#define	OTG_HCINTMSK0_NYET										(0x1u<<6)
#define	OTG_HCINTMSK0_ACKM										(0x1u<<5)
#define	OTG_HCINTMSK0_NAKM										(0x1u<<4)
#define	OTG_HCINTMSK0_STALLM									(0x1u<<3)
#define	OTG_HCINTMSK0_AHBERRM									(0x1u<<2)
#define	OTG_HCINTMSK0_CHHM										(0x1u<<1)
#define	OTG_HCINTMSK0_XFRCM										(0x1u<<0)

#define	OTG_HCINTMSK0_DTERRM_B_0X0								(0x0u<<10)
#define	OTG_HCINTMSK0_DTERRM_B_0X1								(0x1u<<10)
#define	OTG_HCINTMSK0_FRMORM_B_0X0								(0x0u<<9)
#define	OTG_HCINTMSK0_FRMORM_B_0X1								(0x1u<<9)
#define	OTG_HCINTMSK0_BBERRM_B_0X0								(0x0u<<8)
#define	OTG_HCINTMSK0_BBERRM_B_0X1								(0x1u<<8)
#define	OTG_HCINTMSK0_TXERRM_B_0X0								(0x0u<<7)
#define	OTG_HCINTMSK0_TXERRM_B_0X1								(0x1u<<7)
#define	OTG_HCINTMSK0_NYET_B_0X0								(0x0u<<6)
#define	OTG_HCINTMSK0_NYET_B_0X1								(0x1u<<6)
#define	OTG_HCINTMSK0_ACKM_B_0X0								(0x0u<<5)
#define	OTG_HCINTMSK0_ACKM_B_0X1								(0x1u<<5)
#define	OTG_HCINTMSK0_NAKM_B_0X0								(0x0u<<4)
#define	OTG_HCINTMSK0_NAKM_B_0X1								(0x1u<<4)
#define	OTG_HCINTMSK0_STALLM_B_0X0								(0x0u<<3)
#define	OTG_HCINTMSK0_STALLM_B_0X1								(0x1u<<3)
#define	OTG_HCINTMSK0_AHBERRM_B_0X0								(0x0u<<2)
#define	OTG_HCINTMSK0_AHBERRM_B_0X1								(0x1u<<2)
#define	OTG_HCINTMSK0_CHHM_B_0X0								(0x0u<<1)
#define	OTG_HCINTMSK0_CHHM_B_0X1								(0x1u<<1)
#define	OTG_HCINTMSK0_XFRCM_B_0X0								(0x0u<<0)
#define	OTG_HCINTMSK0_XFRCM_B_0X1								(0x1u<<0)

// HCTSIZ0 Configuration

#define	OTG_HCTSIZ0_DOPNG										(0x1u<<31)
#define	OTG_HCTSIZ0_DPID										(0x3u<<29)
#define	OTG_HCTSIZ0_DPID_0										(0x1u<<29)
#define	OTG_HCTSIZ0_PKTCNT										(0x3FFu<<19)
#define	OTG_HCTSIZ0_PKTCNT_0									(0x1u<<19)
#define	OTG_HCTSIZ0_XFRSIZ										(0x7FFFFu<<0)
#define	OTG_HCTSIZ0_XFRSIZ_0									(0x1u<<0)

#define	OTG_HCTSIZ0_DPID_B_0X0									(0x0u<<29)
#define	OTG_HCTSIZ0_DPID_B_0X1									(0x1u<<29)
#define	OTG_HCTSIZ0_DPID_B_0X2									(0x2u<<29)
#define	OTG_HCTSIZ0_DPID_B_0X3									(0x3u<<29)

