hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
// HCDMA0 Configuration

#define	OTG_HCDMA0_DMAADDR										(0xFFFFFFFFu<<0)
#define	OTG_HCDMA0_DMAADDR_0									(0x1u<<0)

// HCCHAR1 Configuration

#define	OTG_HCCHAR1_CHENA										(0x1u<<31)
#define	OTG_HCCHAR1_CHDIS										(0x1u<<30)
#define	OTG_HCCHAR1_ODDFRM										(0x1u<<29)
#define	OTG_HCCHAR1_DAD											(0x7Fu<<22)
#define	OTG_HCCHAR1_DAD_0										(0x1u<<22)
#define	OTG_HCCHAR1_MCNT										(0x3u<<20)
#define	OTG_HCCHAR1_MCNT_0										(0x1u<<20)
#define	OTG_HCCHAR1_EPTYP										(0x3u<<18)
#define	OTG_HCCHAR1_EPTYP_0										(0x1u<<18)
#define	OTG_HCCHAR1_LSDEV										(0x1u<<17)
#define	OTG_HCCHAR1_EPDIR										(0x1u<<15)
#define	OTG_HCCHAR1_EPNUM										(0xFu<<11)
#define	OTG_HCCHAR1_EPNUM_0										(0x1u<<11)
#define	OTG_HCCHAR1_MPSIZ										(0x7FFu<<0)
#define	OTG_HCCHAR1_MPSIZ_0										(0x1u<<0)

#define	OTG_HCCHAR1_CHENA_B_0X0									(0x0u<<31)
#define	OTG_HCCHAR1_CHENA_B_0X1									(0x1u<<31)
#define	OTG_HCCHAR1_ODDFRM_B_0X0								(0x0u<<29)
#define	OTG_HCCHAR1_ODDFRM_B_0X1								(0x1u<<29)
#define	OTG_HCCHAR1_MCNT_B_0X1									(0x1u<<20)
#define	OTG_HCCHAR1_MCNT_B_0X2									(0x2u<<20)
#define	OTG_HCCHAR1_MCNT_B_0X3									(0x3u<<20)
#define	OTG_HCCHAR1_EPTYP_B_0X0									(0x0u<<18)
#define	OTG_HCCHAR1_EPTYP_B_0X1									(0x1u<<18)
#define	OTG_HCCHAR1_EPTYP_B_0X2									(0x2u<<18)
#define	OTG_HCCHAR1_EPTYP_B_0X3									(0x3u<<18)
#define	OTG_HCCHAR1_EPDIR_B_0X0									(0x0u<<15)
#define	OTG_HCCHAR1_EPDIR_B_0X1									(0x1u<<15)

// HCSPLT1 Configuration

#define	OTG_HCSPLT1_SPLITEN										(0x1u<<31)
#define	OTG_HCSPLT1_COMPLSPLT									(0x1u<<16)
#define	OTG_HCSPLT1_XACTPOS										(0x3u<<14)
#define	OTG_HCSPLT1_XACTPOS_0									(0x1u<<14)
#define	OTG_HCSPLT1_HUBADDR										(0x7Fu<<7)
#define	OTG_HCSPLT1_HUBADDR_0									(0x1u<<7)
#define	OTG_HCSPLT1_PRTADDR										(0x7Fu<<0)
#define	OTG_HCSPLT1_PRTADDR_0									(0x1u<<0)

#define	OTG_HCSPLT1_XACTPOS_B_0X3								(0x3u<<14)
#define	OTG_HCSPLT1_XACTPOS_B_0X2								(0x2u<<14)
#define	OTG_HCSPLT1_XACTPOS_B_0X0								(0x0u<<14)
#define	OTG_HCSPLT1_XACTPOS_B_0X1								(0x1u<<14)

// HCINT1 Configuration

#define	OTG_HCINT1_DTERR										(0x1u<<10)
#define	OTG_HCINT1_FRMOR										(0x1u<<9)
#define	OTG_HCINT1_BBERR										(0x1u<<8)
#define	OTG_HCINT1_TXERR										(0x1u<<7)
#define	OTG_HCINT1_NYET											(0x1u<<6)
#define	OTG_HCINT1_ACK											(0x1u<<5)
#define	OTG_HCINT1_NAK											(0x1u<<4)
#define	OTG_HCINT1_STALL										(0x1u<<3)
#define	OTG_HCINT1_AHBERR										(0x1u<<2)
#define	OTG_HCINT1_CHH											(0x1u<<1)
#define	OTG_HCINT1_XFRC											(0x1u<<0)

// HCINTMSK1 Configuration

#define	OTG_HCINTMSK1_DTERRM									(0x1u<<10)
#define	OTG_HCINTMSK1_FRMORM									(0x1u<<9)
#define	OTG_HCINTMSK1_BBERRM									(0x1u<<8)
#define	OTG_HCINTMSK1_TXERRM									(0x1u<<7)
#define	OTG_HCINTMSK1_NYET										(0x1u<<6)
#define	OTG_HCINTMSK1_ACKM										(0x1u<<5)
#define	OTG_HCINTMSK1_NAKM										(0x1u<<4)
#define	OTG_HCINTMSK1_STALLM									(0x1u<<3)
#define	OTG_HCINTMSK1_AHBERRM									(0x1u<<2)
#define	OTG_HCINTMSK1_CHHM										(0x1u<<1)
#define	OTG_HCINTMSK1_XFRCM										(0x1u<<0)

#define	OTG_HCINTMSK1_DTERRM_B_0X0								(0x0u<<10)
#define	OTG_HCINTMSK1_DTERRM_B_0X1								(0x1u<<10)
#define	OTG_HCINTMSK1_FRMORM_B_0X0								(0x0u<<9)
#define	OTG_HCINTMSK1_FRMORM_B_0X1								(0x1u<<9)
#define	OTG_HCINTMSK1_BBERRM_B_0X0								(0x0u<<8)
#define	OTG_HCINTMSK1_BBERRM_B_0X1								(0x1u<<8)
#define	OTG_HCINTMSK1_TXERRM_B_0X0								(0x0u<<7)
#define	OTG_HCINTMSK1_TXERRM_B_0X1								(0x1u<<7)
#define	OTG_HCINTMSK1_NYET_B_0X0								(0x0u<<6)
#define	OTG_HCINTMSK1_NYET_B_0X1								(0x1u<<6)
#define	OTG_HCINTMSK1_ACKM_B_0X0								(0x0u<<5)
#define	OTG_HCINTMSK1_ACKM_B_0X1								(0x1u<<5)
#define	OTG_HCINTMSK1_NAKM_B_0X0								(0x0u<<4)
#define	OTG_HCINTMSK1_NAKM_B_0X1								(0x1u<<4)
#define	OTG_HCINTMSK1_STALLM_B_0X0								(0x0u<<3)
#define	OTG_HCINTMSK1_STALLM_B_0X1								(0x1u<<3)
#define	OTG_HCINTMSK1_AHBERRM_B_0X0								(0x0u<<2)
#define	OTG_HCINTMSK1_AHBERRM_B_0X1								(0x1u<<2)
#define	OTG_HCINTMSK1_CHHM_B_0X0								(0x0u<<1)
#define	OTG_HCINTMSK1_CHHM_B_0X1								(0x1u<<1)
#define	OTG_HCINTMSK1_XFRCM_B_0X0								(0x0u<<0)
#define	OTG_HCINTMSK1_XFRCM_B_0X1								(0x1u<<0)

// HCTSIZ1 Configuration

#define	OTG_HCTSIZ1_DOPNG										(0x1u<<31)
#define	OTG_HCTSIZ1_DPID										(0x3u<<29)
#define	OTG_HCTSIZ1_DPID_0										(0x1u<<29)
#define	OTG_HCTSIZ1_PKTCNT										(0x3FFu<<19)
#define	OTG_HCTSIZ1_PKTCNT_0									(0x1u<<19)
#define	OTG_HCTSIZ1_XFRSIZ										(0x7FFFFu<<0)
#define	OTG_HCTSIZ1_XFRSIZ_0									(0x1u<<0)

#define	OTG_HCTSIZ1_DPID_B_0X0									(0x0u<<29)
#define	OTG_HCTSIZ1_DPID_B_0X1									(0x1u<<29)
#define	OTG_HCTSIZ1_DPID_B_0X2									(0x2u<<29)
#define	OTG_HCTSIZ1_DPID_B_0X3									(0x3u<<29)

// HCDMA1 Configuration

#define	OTG_HCDMA1_DMAADDR										(0xFFFFFFFFu<<0)
#define	OTG_HCDMA1_DMAADDR_0									(0x1u<<0)

// HCCHAR2 Configuration

#define	OTG_HCCHAR2_CHENA										(0x1u<<31)
#define	OTG_HCCHAR2_CHDIS										(0x1u<<30)
#define	OTG_HCCHAR2_ODDFRM										(0x1u<<29)
#define	OTG_HCCHAR2_DAD											(0x7Fu<<22)
#define	OTG_HCCHAR2_DAD_0										(0x1u<<22)
#define	OTG_HCCHAR2_MCNT										(0x3u<<20)
#define	OTG_HCCHAR2_MCNT_0										(0x1u<<20)
#define	OTG_HCCHAR2_EPTYP										(0x3u<<18)
#define	OTG_HCCHAR2_EPTYP_0										(0x1u<<18)
#define	OTG_HCCHAR2_LSDEV										(0x1u<<17)
#define	OTG_HCCHAR2_EPDIR										(0x1u<<15)
#define	OTG_HCCHAR2_EPNUM										(0xFu<<11)
#define	OTG_HCCHAR2_EPNUM_0										(0x1u<<11)
#define	OTG_HCCHAR2_MPSIZ										(0x7FFu<<0)
#define	OTG_HCCHAR2_MPSIZ_0										(0x1u<<0)

#define	OTG_HCCHAR2_CHENA_B_0X0									(0x0u<<31)
#define	OTG_HCCHAR2_CHENA_B_0X1									(0x1u<<31)
#define	OTG_HCCHAR2_ODDFRM_B_0X0								(0x0u<<29)
#define	OTG_HCCHAR2_ODDFRM_B_0X1								(0x1u<<29)
#define	OTG_HCCHAR2_MCNT_B_0X1									(0x1u<<20)
#define	OTG_HCCHAR2_MCNT_B_0X2									(0x2u<<20)
#define	OTG_HCCHAR2_MCNT_B_0X3									(0x3u<<20)
#define	OTG_HCCHAR2_EPTYP_B_0X0									(0x0u<<18)
#define	OTG_HCCHAR2_EPTYP_B_0X1									(0x1u<<18)
#define	OTG_HCCHAR2_EPTYP_B_0X2									(0x2u<<18)
#define	OTG_HCCHAR2_EPTYP_B_0X3									(0x3u<<18)
#define	OTG_HCCHAR2_EPDIR_B_0X0									(0x0u<<15)
#define	OTG_HCCHAR2_EPDIR_B_0X1									(0x1u<<15)

// HCSPLT2 Configuration

#define	OTG_HCSPLT2_SPLITEN										(0x1u<<31)
#define	OTG_HCSPLT2_COMPLSPLT									(0x1u<<16)
#define	OTG_HCSPLT2_XACTPOS										(0x3u<<14)
#define	OTG_HCSPLT2_XACTPOS_0									(0x1u<<14)
#define	OTG_HCSPLT2_HUBADDR										(0x7Fu<<7)
#define	OTG_HCSPLT2_HUBADDR_0									(0x1u<<7)
#define	OTG_HCSPLT2_PRTADDR										(0x7Fu<<0)
#define	OTG_HCSPLT2_PRTADDR_0									(0x1u<<0)

#define	OTG_HCSPLT2_XACTPOS_B_0X3								(0x3u<<14)
#define	OTG_HCSPLT2_XACTPOS_B_0X2								(0x2u<<14)
#define	OTG_HCSPLT2_XACTPOS_B_0X0								(0x0u<<14)
#define	OTG_HCSPLT2_XACTPOS_B_0X1								(0x1u<<14)

// HCINT2 Configuration

#define	OTG_HCINT2_DTERR										(0x1u<<10)
#define	OTG_HCINT2_FRMOR										(0x1u<<9)
#define	OTG_HCINT2_BBERR										(0x1u<<8)
#define	OTG_HCINT2_TXERR										(0x1u<<7)
#define	OTG_HCINT2_NYET											(0x1u<<6)
#define	OTG_HCINT2_ACK											(0x1u<<5)
#define	OTG_HCINT2_NAK											(0x1u<<4)
#define	OTG_HCINT2_STALL										(0x1u<<3)
#define	OTG_HCINT2_AHBERR										(0x1u<<2)
#define	OTG_HCINT2_CHH											(0x1u<<1)
#define	OTG_HCINT2_XFRC											(0x1u<<0)

