hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
// HCINTMSK2 Configuration

#define	OTG_HCINTMSK2_DTERRM									(0x1u<<10)
#define	OTG_HCINTMSK2_FRMORM									(0x1u<<9)
#define	OTG_HCINTMSK2_BBERRM									(0x1u<<8)
#define	OTG_HCINTMSK2_TXERRM									(0x1u<<7)
#define	OTG_HCINTMSK2_NYET										(0x1u<<6)
#define	OTG_HCINTMSK2_ACKM										(0x1u<<5)
#define	OTG_HCINTMSK2_NAKM										(0x1u<<4)
#define	OTG_HCINTMSK2_STALLM									(0x1u<<3)
#define	OTG_HCINTMSK2_AHBERRM									(0x1u<<2)
#define	OTG_HCINTMSK2_CHHM										(0x1u<<1)
#define	OTG_HCINTMSK2_XFRCM										(0x1u<<0)

#define	OTG_HCINTMSK2_DTERRM_B_0X0								(0x0u<<10)
#define	OTG_HCINTMSK2_DTERRM_B_0X1								(0x1u<<10)
#define	OTG_HCINTMSK2_FRMORM_B_0X0								(0x0u<<9)
#define	OTG_HCINTMSK2_FRMORM_B_0X1								(0x1u<<9)
#define	OTG_HCINTMSK2_BBERRM_B_0X0								(0x0u<<8)
#define	OTG_HCINTMSK2_BBERRM_B_0X1								(0x1u<<8)
#define	OTG_HCINTMSK2_TXERRM_B_0X0								(0x0u<<7)
#define	OTG_HCINTMSK2_TXERRM_B_0X1								(0x1u<<7)
#define	OTG_HCINTMSK2_NYET_B_0X0								(0x0u<<6)
#define	OTG_HCINTMSK2_NYET_B_0X1								(0x1u<<6)
#define	OTG_HCINTMSK2_ACKM_B_0X0								(0x0u<<5)
#define	OTG_HCINTMSK2_ACKM_B_0X1								(0x1u<<5)
#define	OTG_HCINTMSK2_NAKM_B_0X0								(0x0u<<4)
#define	OTG_HCINTMSK2_NAKM_B_0X1								(0x1u<<4)
#define	OTG_HCINTMSK2_STALLM_B_0X0								(0x0u<<3)
#define	OTG_HCINTMSK2_STALLM_B_0X1								(0x1u<<3)
#define	OTG_HCINTMSK2_AHBERRM_B_0X0								(0x0u<<2)
#define	OTG_HCINTMSK2_AHBERRM_B_0X1								(0x1u<<2)
#define	OTG_HCINTMSK2_CHHM_B_0X0								(0x0u<<1)
#define	OTG_HCINTMSK2_CHHM_B_0X1								(0x1u<<1)
#define	OTG_HCINTMSK2_XFRCM_B_0X0								(0x0u<<0)
#define	OTG_HCINTMSK2_XFRCM_B_0X1								(0x1u<<0)

// HCTSIZ2 Configuration

#define	OTG_HCTSIZ2_DOPNG										(0x1u<<31)
#define	OTG_HCTSIZ2_DPID										(0x3u<<29)
#define	OTG_HCTSIZ2_DPID_0										(0x1u<<29)
#define	OTG_HCTSIZ2_PKTCNT										(0x3FFu<<19)
#define	OTG_HCTSIZ2_PKTCNT_0									(0x1u<<19)
#define	OTG_HCTSIZ2_XFRSIZ										(0x7FFFFu<<0)
#define	OTG_HCTSIZ2_XFRSIZ_0									(0x1u<<0)

#define	OTG_HCTSIZ2_DPID_B_0X0									(0x0u<<29)
#define	OTG_HCTSIZ2_DPID_B_0X1									(0x1u<<29)
#define	OTG_HCTSIZ2_DPID_B_0X2									(0x2u<<29)
#define	OTG_HCTSIZ2_DPID_B_0X3									(0x3u<<29)

// HCDMA2 Configuration

#define	OTG_HCDMA2_DMAADDR										(0xFFFFFFFFu<<0)
#define	OTG_HCDMA2_DMAADDR_0									(0x1u<<0)

// HCCHAR3 Configuration

#define	OTG_HCCHAR3_CHENA										(0x1u<<31)
#define	OTG_HCCHAR3_CHDIS										(0x1u<<30)
#define	OTG_HCCHAR3_ODDFRM										(0x1u<<29)
#define	OTG_HCCHAR3_DAD											(0x7Fu<<22)
#define	OTG_HCCHAR3_DAD_0										(0x1u<<22)
#define	OTG_HCCHAR3_MCNT										(0x3u<<20)
#define	OTG_HCCHAR3_MCNT_0										(0x1u<<20)
#define	OTG_HCCHAR3_EPTYP										(0x3u<<18)
#define	OTG_HCCHAR3_EPTYP_0										(0x1u<<18)
#define	OTG_HCCHAR3_LSDEV										(0x1u<<17)
#define	OTG_HCCHAR3_EPDIR										(0x1u<<15)
#define	OTG_HCCHAR3_EPNUM										(0xFu<<11)
#define	OTG_HCCHAR3_EPNUM_0										(0x1u<<11)
#define	OTG_HCCHAR3_MPSIZ										(0x7FFu<<0)
#define	OTG_HCCHAR3_MPSIZ_0										(0x1u<<0)

#define	OTG_HCCHAR3_CHENA_B_0X0									(0x0u<<31)
#define	OTG_HCCHAR3_CHENA_B_0X1									(0x1u<<31)
#define	OTG_HCCHAR3_ODDFRM_B_0X0								(0x0u<<29)
#define	OTG_HCCHAR3_ODDFRM_B_0X1								(0x1u<<29)
#define	OTG_HCCHAR3_MCNT_B_0X1									(0x1u<<20)
#define	OTG_HCCHAR3_MCNT_B_0X2									(0x2u<<20)
#define	OTG_HCCHAR3_MCNT_B_0X3									(0x3u<<20)
#define	OTG_HCCHAR3_EPTYP_B_0X0									(0x0u<<18)
#define	OTG_HCCHAR3_EPTYP_B_0X1									(0x1u<<18)
#define	OTG_HCCHAR3_EPTYP_B_0X2									(0x2u<<18)
#define	OTG_HCCHAR3_EPTYP_B_0X3									(0x3u<<18)
#define	OTG_HCCHAR3_EPDIR_B_0X0									(0x0u<<15)
#define	OTG_HCCHAR3_EPDIR_B_0X1									(0x1u<<15)

// HCSPLT3 Configuration

#define	OTG_HCSPLT3_SPLITEN										(0x1u<<31)
#define	OTG_HCSPLT3_COMPLSPLT									(0x1u<<16)
#define	OTG_HCSPLT3_XACTPOS										(0x3u<<14)
#define	OTG_HCSPLT3_XACTPOS_0									(0x1u<<14)
#define	OTG_HCSPLT3_HUBADDR										(0x7Fu<<7)
#define	OTG_HCSPLT3_HUBADDR_0									(0x1u<<7)
#define	OTG_HCSPLT3_PRTADDR										(0x7Fu<<0)
#define	OTG_HCSPLT3_PRTADDR_0									(0x1u<<0)

#define	OTG_HCSPLT3_XACTPOS_B_0X3								(0x3u<<14)
#define	OTG_HCSPLT3_XACTPOS_B_0X2								(0x2u<<14)
#define	OTG_HCSPLT3_XACTPOS_B_0X0								(0x0u<<14)
#define	OTG_HCSPLT3_XACTPOS_B_0X1								(0x1u<<14)

// HCINT3 Configuration

#define	OTG_HCINT3_DTERR										(0x1u<<10)
#define	OTG_HCINT3_FRMOR										(0x1u<<9)
#define	OTG_HCINT3_BBERR										(0x1u<<8)
#define	OTG_HCINT3_TXERR										(0x1u<<7)
#define	OTG_HCINT3_NYET											(0x1u<<6)
#define	OTG_HCINT3_ACK											(0x1u<<5)
#define	OTG_HCINT3_NAK											(0x1u<<4)
#define	OTG_HCINT3_STALL										(0x1u<<3)
#define	OTG_HCINT3_AHBERR										(0x1u<<2)
#define	OTG_HCINT3_CHH											(0x1u<<1)
#define	OTG_HCINT3_XFRC											(0x1u<<0)

// HCINTMSK3 Configuration

#define	OTG_HCINTMSK3_DTERRM									(0x1u<<10)
#define	OTG_HCINTMSK3_FRMORM									(0x1u<<9)
#define	OTG_HCINTMSK3_BBERRM									(0x1u<<8)
#define	OTG_HCINTMSK3_TXERRM									(0x1u<<7)
#define	OTG_HCINTMSK3_NYET										(0x1u<<6)
#define	OTG_HCINTMSK3_ACKM										(0x1u<<5)
#define	OTG_HCINTMSK3_NAKM										(0x1u<<4)
#define	OTG_HCINTMSK3_STALLM									(0x1u<<3)
#define	OTG_HCINTMSK3_AHBERRM									(0x1u<<2)
#define	OTG_HCINTMSK3_CHHM										(0x1u<<1)
#define	OTG_HCINTMSK3_XFRCM										(0x1u<<0)

#define	OTG_HCINTMSK3_DTERRM_B_0X0								(0x0u<<10)
#define	OTG_HCINTMSK3_DTERRM_B_0X1								(0x1u<<10)
#define	OTG_HCINTMSK3_FRMORM_B_0X0								(0x0u<<9)
#define	OTG_HCINTMSK3_FRMORM_B_0X1								(0x1u<<9)
#define	OTG_HCINTMSK3_BBERRM_B_0X0								(0x0u<<8)
#define	OTG_HCINTMSK3_BBERRM_B_0X1								(0x1u<<8)
#define	OTG_HCINTMSK3_TXERRM_B_0X0								(0x0u<<7)
#define	OTG_HCINTMSK3_TXERRM_B_0X1								(0x1u<<7)
#define	OTG_HCINTMSK3_NYET_B_0X0								(0x0u<<6)
#define	OTG_HCINTMSK3_NYET_B_0X1								(0x1u<<6)
#define	OTG_HCINTMSK3_ACKM_B_0X0								(0x0u<<5)
#define	OTG_HCINTMSK3_ACKM_B_0X1								(0x1u<<5)
#define	OTG_HCINTMSK3_NAKM_B_0X0								(0x0u<<4)
#define	OTG_HCINTMSK3_NAKM_B_0X1								(0x1u<<4)
#define	OTG_HCINTMSK3_STALLM_B_0X0								(0x0u<<3)
#define	OTG_HCINTMSK3_STALLM_B_0X1								(0x1u<<3)
#define	OTG_HCINTMSK3_AHBERRM_B_0X0								(0x0u<<2)
#define	OTG_HCINTMSK3_AHBERRM_B_0X1								(0x1u<<2)
#define	OTG_HCINTMSK3_CHHM_B_0X0								(0x0u<<1)
#define	OTG_HCINTMSK3_CHHM_B_0X1								(0x1u<<1)
#define	OTG_HCINTMSK3_XFRCM_B_0X0								(0x0u<<0)
#define	OTG_HCINTMSK3_XFRCM_B_0X1								(0x1u<<0)

