hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
// HCTSIZ3 Configuration

#define	OTG_HCTSIZ3_DOPNG										(0x1u<<31)
#define	OTG_HCTSIZ3_DPID										(0x3u<<29)
#define	OTG_HCTSIZ3_DPID_0										(0x1u<<29)
#define	OTG_HCTSIZ3_PKTCNT										(0x3FFu<<19)
#define	OTG_HCTSIZ3_PKTCNT_0									(0x1u<<19)
#define	OTG_HCTSIZ3_XFRSIZ										(0x7FFFFu<<0)
#define	OTG_HCTSIZ3_XFRSIZ_0									(0x1u<<0)

#define	OTG_HCTSIZ3_DPID_B_0X0									(0x0u<<29)
#define	OTG_HCTSIZ3_DPID_B_0X1									(0x1u<<29)
#define	OTG_HCTSIZ3_DPID_B_0X2									(0x2u<<29)
#define	OTG_HCTSIZ3_DPID_B_0X3									(0x3u<<29)

// HCDMA3 Configuration

#define	OTG_HCDMA3_DMAADDR										(0xFFFFFFFFu<<0)
#define	OTG_HCDMA3_DMAADDR_0									(0x1u<<0)

// HCCHAR4 Configuration

#define	OTG_HCCHAR4_CHENA										(0x1u<<31)
#define	OTG_HCCHAR4_CHDIS										(0x1u<<30)
#define	OTG_HCCHAR4_ODDFRM										(0x1u<<29)
#define	OTG_HCCHAR4_DAD											(0x7Fu<<22)
#define	OTG_HCCHAR4_DAD_0										(0x1u<<22)
#define	OTG_HCCHAR4_MCNT										(0x3u<<20)
#define	OTG_HCCHAR4_MCNT_0										(0x1u<<20)
#define	OTG_HCCHAR4_EPTYP										(0x3u<<18)
#define	OTG_HCCHAR4_EPTYP_0										(0x1u<<18)
#define	OTG_HCCHAR4_LSDEV										(0x1u<<17)
#define	OTG_HCCHAR4_EPDIR										(0x1u<<15)
#define	OTG_HCCHAR4_EPNUM										(0xFu<<11)
#define	OTG_HCCHAR4_EPNUM_0										(0x1u<<11)
#define	OTG_HCCHAR4_MPSIZ										(0x7FFu<<0)
#define	OTG_HCCHAR4_MPSIZ_0										(0x1u<<0)

#define	OTG_HCCHAR4_CHENA_B_0X0									(0x0u<<31)
#define	OTG_HCCHAR4_CHENA_B_0X1									(0x1u<<31)
#define	OTG_HCCHAR4_ODDFRM_B_0X0								(0x0u<<29)
#define	OTG_HCCHAR4_ODDFRM_B_0X1								(0x1u<<29)
#define	OTG_HCCHAR4_MCNT_B_0X1									(0x1u<<20)
#define	OTG_HCCHAR4_MCNT_B_0X2									(0x2u<<20)
#define	OTG_HCCHAR4_MCNT_B_0X3									(0x3u<<20)
#define	OTG_HCCHAR4_EPTYP_B_0X0									(0x0u<<18)
#define	OTG_HCCHAR4_EPTYP_B_0X1									(0x1u<<18)
#define	OTG_HCCHAR4_EPTYP_B_0X2									(0x2u<<18)
#define	OTG_HCCHAR4_EPTYP_B_0X3									(0x3u<<18)
#define	OTG_HCCHAR4_EPDIR_B_0X0									(0x0u<<15)
#define	OTG_HCCHAR4_EPDIR_B_0X1									(0x1u<<15)

// HCSPLT4 Configuration

#define	OTG_HCSPLT4_SPLITEN										(0x1u<<31)
#define	OTG_HCSPLT4_COMPLSPLT									(0x1u<<16)
#define	OTG_HCSPLT4_XACTPOS										(0x3u<<14)
#define	OTG_HCSPLT4_XACTPOS_0									(0x1u<<14)
#define	OTG_HCSPLT4_HUBADDR										(0x7Fu<<7)
#define	OTG_HCSPLT4_HUBADDR_0									(0x1u<<7)
#define	OTG_HCSPLT4_PRTADDR										(0x7Fu<<0)
#define	OTG_HCSPLT4_PRTADDR_0									(0x1u<<0)

#define	OTG_HCSPLT4_XACTPOS_B_0X3								(0x3u<<14)
#define	OTG_HCSPLT4_XACTPOS_B_0X2								(0x2u<<14)
#define	OTG_HCSPLT4_XACTPOS_B_0X0								(0x0u<<14)
#define	OTG_HCSPLT4_XACTPOS_B_0X1								(0x1u<<14)

// HCINT4 Configuration

#define	OTG_HCINT4_DTERR										(0x1u<<10)
#define	OTG_HCINT4_FRMOR										(0x1u<<9)
#define	OTG_HCINT4_BBERR										(0x1u<<8)
#define	OTG_HCINT4_TXERR										(0x1u<<7)
#define	OTG_HCINT4_NYET											(0x1u<<6)
#define	OTG_HCINT4_ACK											(0x1u<<5)
#define	OTG_HCINT4_NAK											(0x1u<<4)
#define	OTG_HCINT4_STALL										(0x1u<<3)
#define	OTG_HCINT4_AHBERR										(0x1u<<2)
#define	OTG_HCINT4_CHH											(0x1u<<1)
#define	OTG_HCINT4_XFRC											(0x1u<<0)

// HCINTMSK4 Configuration

#define	OTG_HCINTMSK4_DTERRM									(0x1u<<10)
#define	OTG_HCINTMSK4_FRMORM									(0x1u<<9)
#define	OTG_HCINTMSK4_BBERRM									(0x1u<<8)
#define	OTG_HCINTMSK4_TXERRM									(0x1u<<7)
#define	OTG_HCINTMSK4_NYET										(0x1u<<6)
#define	OTG_HCINTMSK4_ACKM										(0x1u<<5)
#define	OTG_HCINTMSK4_NAKM										(0x1u<<4)
#define	OTG_HCINTMSK4_STALLM									(0x1u<<3)
#define	OTG_HCINTMSK4_AHBERRM									(0x1u<<2)
#define	OTG_HCINTMSK4_CHHM										(0x1u<<1)
#define	OTG_HCINTMSK4_XFRCM										(0x1u<<0)

#define	OTG_HCINTMSK4_DTERRM_B_0X0								(0x0u<<10)
#define	OTG_HCINTMSK4_DTERRM_B_0X1								(0x1u<<10)
#define	OTG_HCINTMSK4_FRMORM_B_0X0								(0x0u<<9)
#define	OTG_HCINTMSK4_FRMORM_B_0X1								(0x1u<<9)
#define	OTG_HCINTMSK4_BBERRM_B_0X0								(0x0u<<8)
#define	OTG_HCINTMSK4_BBERRM_B_0X1								(0x1u<<8)
#define	OTG_HCINTMSK4_TXERRM_B_0X0								(0x0u<<7)
#define	OTG_HCINTMSK4_TXERRM_B_0X1								(0x1u<<7)
#define	OTG_HCINTMSK4_NYET_B_0X0								(0x0u<<6)
#define	OTG_HCINTMSK4_NYET_B_0X1								(0x1u<<6)
#define	OTG_HCINTMSK4_ACKM_B_0X0								(0x0u<<5)
#define	OTG_HCINTMSK4_ACKM_B_0X1								(0x1u<<5)
#define	OTG_HCINTMSK4_NAKM_B_0X0								(0x0u<<4)
#define	OTG_HCINTMSK4_NAKM_B_0X1								(0x1u<<4)
#define	OTG_HCINTMSK4_STALLM_B_0X0								(0x0u<<3)
#define	OTG_HCINTMSK4_STALLM_B_0X1								(0x1u<<3)
#define	OTG_HCINTMSK4_AHBERRM_B_0X0								(0x0u<<2)
#define	OTG_HCINTMSK4_AHBERRM_B_0X1								(0x1u<<2)
#define	OTG_HCINTMSK4_CHHM_B_0X0								(0x0u<<1)
#define	OTG_HCINTMSK4_CHHM_B_0X1								(0x1u<<1)
#define	OTG_HCINTMSK4_XFRCM_B_0X0								(0x0u<<0)
#define	OTG_HCINTMSK4_XFRCM_B_0X1								(0x1u<<0)

// HCTSIZ4 Configuration

#define	OTG_HCTSIZ4_DOPNG										(0x1u<<31)
#define	OTG_HCTSIZ4_DPID										(0x3u<<29)
#define	OTG_HCTSIZ4_DPID_0										(0x1u<<29)
#define	OTG_HCTSIZ4_PKTCNT										(0x3FFu<<19)
#define	OTG_HCTSIZ4_PKTCNT_0									(0x1u<<19)
#define	OTG_HCTSIZ4_XFRSIZ										(0x7FFFFu<<0)
#define	OTG_HCTSIZ4_XFRSIZ_0									(0x1u<<0)

#define	OTG_HCTSIZ4_DPID_B_0X0									(0x0u<<29)
#define	OTG_HCTSIZ4_DPID_B_0X1									(0x1u<<29)
#define	OTG_HCTSIZ4_DPID_B_0X2									(0x2u<<29)
#define	OTG_HCTSIZ4_DPID_B_0X3									(0x3u<<29)

// HCDMA4 Configuration

#define	OTG_HCDMA4_DMAADDR										(0xFFFFFFFFu<<0)
#define	OTG_HCDMA4_DMAADDR_0									(0x1u<<0)

// HCCHAR5 Configuration

#define	OTG_HCCHAR5_CHENA										(0x1u<<31)
#define	OTG_HCCHAR5_CHDIS										(0x1u<<30)
#define	OTG_HCCHAR5_ODDFRM										(0x1u<<29)
#define	OTG_HCCHAR5_DAD											(0x7Fu<<22)
#define	OTG_HCCHAR5_DAD_0										(0x1u<<22)
#define	OTG_HCCHAR5_MCNT										(0x3u<<20)
#define	OTG_HCCHAR5_MCNT_0										(0x1u<<20)
#define	OTG_HCCHAR5_EPTYP										(0x3u<<18)
#define	OTG_HCCHAR5_EPTYP_0										(0x1u<<18)
#define	OTG_HCCHAR5_LSDEV										(0x1u<<17)
#define	OTG_HCCHAR5_EPDIR										(0x1u<<15)
#define	OTG_HCCHAR5_EPNUM										(0xFu<<11)
#define	OTG_HCCHAR5_EPNUM_0										(0x1u<<11)
#define	OTG_HCCHAR5_MPSIZ										(0x7FFu<<0)
#define	OTG_HCCHAR5_MPSIZ_0										(0x1u<<0)

#define	OTG_HCCHAR5_CHENA_B_0X0									(0x0u<<31)
#define	OTG_HCCHAR5_CHENA_B_0X1									(0x1u<<31)
#define	OTG_HCCHAR5_ODDFRM_B_0X0								(0x0u<<29)
#define	OTG_HCCHAR5_ODDFRM_B_0X1								(0x1u<<29)
#define	OTG_HCCHAR5_MCNT_B_0X1									(0x1u<<20)
#define	OTG_HCCHAR5_MCNT_B_0X2									(0x2u<<20)
#define	OTG_HCCHAR5_MCNT_B_0X3									(0x3u<<20)
#define	OTG_HCCHAR5_EPTYP_B_0X0									(0x0u<<18)
#define	OTG_HCCHAR5_EPTYP_B_0X1									(0x1u<<18)
#define	OTG_HCCHAR5_EPTYP_B_0X2									(0x2u<<18)
#define	OTG_HCCHAR5_EPTYP_B_0X3									(0x3u<<18)
#define	OTG_HCCHAR5_EPDIR_B_0X0									(0x0u<<15)
#define	OTG_HCCHAR5_EPDIR_B_0X1									(0x1u<<15)

