hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
#define	OTG_HCINTMSK9_DTERRM_B_0X0								(0x0u<<10)
#define	OTG_HCINTMSK9_DTERRM_B_0X1								(0x1u<<10)
#define	OTG_HCINTMSK9_FRMORM_B_0X0								(0x0u<<9)
#define	OTG_HCINTMSK9_FRMORM_B_0X1								(0x1u<<9)
#define	OTG_HCINTMSK9_BBERRM_B_0X0								(0x0u<<8)
#define	OTG_HCINTMSK9_BBERRM_B_0X1								(0x1u<<8)
#define	OTG_HCINTMSK9_TXERRM_B_0X0								(0x0u<<7)
#define	OTG_HCINTMSK9_TXERRM_B_0X1								(0x1u<<7)
#define	OTG_HCINTMSK9_NYET_B_0X0								(0x0u<<6)
#define	OTG_HCINTMSK9_NYET_B_0X1								(0x1u<<6)
#define	OTG_HCINTMSK9_ACKM_B_0X0								(0x0u<<5)
#define	OTG_HCINTMSK9_ACKM_B_0X1								(0x1u<<5)
#define	OTG_HCINTMSK9_NAKM_B_0X0								(0x0u<<4)
#define	OTG_HCINTMSK9_NAKM_B_0X1								(0x1u<<4)
#define	OTG_HCINTMSK9_STALLM_B_0X0								(0x0u<<3)
#define	OTG_HCINTMSK9_STALLM_B_0X1								(0x1u<<3)
#define	OTG_HCINTMSK9_AHBERRM_B_0X0								(0x0u<<2)
#define	OTG_HCINTMSK9_AHBERRM_B_0X1								(0x1u<<2)
#define	OTG_HCINTMSK9_CHHM_B_0X0								(0x0u<<1)
#define	OTG_HCINTMSK9_CHHM_B_0X1								(0x1u<<1)
#define	OTG_HCINTMSK9_XFRCM_B_0X0								(0x0u<<0)
#define	OTG_HCINTMSK9_XFRCM_B_0X1								(0x1u<<0)

// HCTSIZ9 Configuration

#define	OTG_HCTSIZ9_DOPNG										(0x1u<<31)
#define	OTG_HCTSIZ9_DPID										(0x3u<<29)
#define	OTG_HCTSIZ9_DPID_0										(0x1u<<29)
#define	OTG_HCTSIZ9_PKTCNT										(0x3FFu<<19)
#define	OTG_HCTSIZ9_PKTCNT_0									(0x1u<<19)
#define	OTG_HCTSIZ9_XFRSIZ										(0x7FFFFu<<0)
#define	OTG_HCTSIZ9_XFRSIZ_0									(0x1u<<0)

#define	OTG_HCTSIZ9_DPID_B_0X0									(0x0u<<29)
#define	OTG_HCTSIZ9_DPID_B_0X1									(0x1u<<29)
#define	OTG_HCTSIZ9_DPID_B_0X2									(0x2u<<29)
#define	OTG_HCTSIZ9_DPID_B_0X3									(0x3u<<29)

// HCDMA9 Configuration

#define	OTG_HCDMA9_DMAADDR										(0xFFFFFFFFu<<0)
#define	OTG_HCDMA9_DMAADDR_0									(0x1u<<0)

// HCCHAR10 Configuration

#define	OTG_HCCHAR10_CHENA										(0x1u<<31)
#define	OTG_HCCHAR10_CHDIS										(0x1u<<30)
#define	OTG_HCCHAR10_ODDFRM										(0x1u<<29)
#define	OTG_HCCHAR10_DAD										(0x7Fu<<22)
#define	OTG_HCCHAR10_DAD_0										(0x1u<<22)
#define	OTG_HCCHAR10_MCNT										(0x3u<<20)
#define	OTG_HCCHAR10_MCNT_0										(0x1u<<20)
#define	OTG_HCCHAR10_EPTYP										(0x3u<<18)
#define	OTG_HCCHAR10_EPTYP_0									(0x1u<<18)
#define	OTG_HCCHAR10_LSDEV										(0x1u<<17)
#define	OTG_HCCHAR10_EPDIR										(0x1u<<15)
#define	OTG_HCCHAR10_EPNUM										(0xFu<<11)
#define	OTG_HCCHAR10_EPNUM_0									(0x1u<<11)
#define	OTG_HCCHAR10_MPSIZ										(0x7FFu<<0)
#define	OTG_HCCHAR10_MPSIZ_0									(0x1u<<0)

#define	OTG_HCCHAR10_CHENA_B_0X0								(0x0u<<31)
#define	OTG_HCCHAR10_CHENA_B_0X1								(0x1u<<31)
#define	OTG_HCCHAR10_ODDFRM_B_0X0								(0x0u<<29)
#define	OTG_HCCHAR10_ODDFRM_B_0X1								(0x1u<<29)
#define	OTG_HCCHAR10_MCNT_B_0X1									(0x1u<<20)
#define	OTG_HCCHAR10_MCNT_B_0X2									(0x2u<<20)
#define	OTG_HCCHAR10_MCNT_B_0X3									(0x3u<<20)
#define	OTG_HCCHAR10_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_HCCHAR10_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_HCCHAR10_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_HCCHAR10_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_HCCHAR10_EPDIR_B_0X0								(0x0u<<15)
#define	OTG_HCCHAR10_EPDIR_B_0X1								(0x1u<<15)

// HCSPLT10 Configuration

#define	OTG_HCSPLT10_SPLITEN									(0x1u<<31)
#define	OTG_HCSPLT10_COMPLSPLT									(0x1u<<16)
#define	OTG_HCSPLT10_XACTPOS									(0x3u<<14)
#define	OTG_HCSPLT10_XACTPOS_0									(0x1u<<14)
#define	OTG_HCSPLT10_HUBADDR									(0x7Fu<<7)
#define	OTG_HCSPLT10_HUBADDR_0									(0x1u<<7)
#define	OTG_HCSPLT10_PRTADDR									(0x7Fu<<0)
#define	OTG_HCSPLT10_PRTADDR_0									(0x1u<<0)

#define	OTG_HCSPLT10_XACTPOS_B_0X3								(0x3u<<14)
#define	OTG_HCSPLT10_XACTPOS_B_0X2								(0x2u<<14)
#define	OTG_HCSPLT10_XACTPOS_B_0X0								(0x0u<<14)
#define	OTG_HCSPLT10_XACTPOS_B_0X1								(0x1u<<14)

// HCINT10 Configuration

#define	OTG_HCINT10_DTERR										(0x1u<<10)
#define	OTG_HCINT10_FRMOR										(0x1u<<9)
#define	OTG_HCINT10_BBERR										(0x1u<<8)
#define	OTG_HCINT10_TXERR										(0x1u<<7)
#define	OTG_HCINT10_NYET										(0x1u<<6)
#define	OTG_HCINT10_ACK											(0x1u<<5)
#define	OTG_HCINT10_NAK											(0x1u<<4)
#define	OTG_HCINT10_STALL										(0x1u<<3)
#define	OTG_HCINT10_AHBERR										(0x1u<<2)
#define	OTG_HCINT10_CHH											(0x1u<<1)
#define	OTG_HCINT10_XFRC										(0x1u<<0)

// HCINTMSK10 Configuration

#define	OTG_HCINTMSK10_DTERRM									(0x1u<<10)
#define	OTG_HCINTMSK10_FRMORM									(0x1u<<9)
#define	OTG_HCINTMSK10_BBERRM									(0x1u<<8)
#define	OTG_HCINTMSK10_TXERRM									(0x1u<<7)
#define	OTG_HCINTMSK10_NYET										(0x1u<<6)
#define	OTG_HCINTMSK10_ACKM										(0x1u<<5)
#define	OTG_HCINTMSK10_NAKM										(0x1u<<4)
#define	OTG_HCINTMSK10_STALLM									(0x1u<<3)
#define	OTG_HCINTMSK10_AHBERRM									(0x1u<<2)
#define	OTG_HCINTMSK10_CHHM										(0x1u<<1)
#define	OTG_HCINTMSK10_XFRCM									(0x1u<<0)

#define	OTG_HCINTMSK10_DTERRM_B_0X0								(0x0u<<10)
#define	OTG_HCINTMSK10_DTERRM_B_0X1								(0x1u<<10)
#define	OTG_HCINTMSK10_FRMORM_B_0X0								(0x0u<<9)
#define	OTG_HCINTMSK10_FRMORM_B_0X1								(0x1u<<9)
#define	OTG_HCINTMSK10_BBERRM_B_0X0								(0x0u<<8)
#define	OTG_HCINTMSK10_BBERRM_B_0X1								(0x1u<<8)
#define	OTG_HCINTMSK10_TXERRM_B_0X0								(0x0u<<7)
#define	OTG_HCINTMSK10_TXERRM_B_0X1								(0x1u<<7)
#define	OTG_HCINTMSK10_NYET_B_0X0								(0x0u<<6)
#define	OTG_HCINTMSK10_NYET_B_0X1								(0x1u<<6)
#define	OTG_HCINTMSK10_ACKM_B_0X0								(0x0u<<5)
#define	OTG_HCINTMSK10_ACKM_B_0X1								(0x1u<<5)
#define	OTG_HCINTMSK10_NAKM_B_0X0								(0x0u<<4)
#define	OTG_HCINTMSK10_NAKM_B_0X1								(0x1u<<4)
#define	OTG_HCINTMSK10_STALLM_B_0X0								(0x0u<<3)
#define	OTG_HCINTMSK10_STALLM_B_0X1								(0x1u<<3)
#define	OTG_HCINTMSK10_AHBERRM_B_0X0							(0x0u<<2)
#define	OTG_HCINTMSK10_AHBERRM_B_0X1							(0x1u<<2)
#define	OTG_HCINTMSK10_CHHM_B_0X0								(0x0u<<1)
#define	OTG_HCINTMSK10_CHHM_B_0X1								(0x1u<<1)
#define	OTG_HCINTMSK10_XFRCM_B_0X0								(0x0u<<0)
#define	OTG_HCINTMSK10_XFRCM_B_0X1								(0x1u<<0)

// HCTSIZ10 Configuration

#define	OTG_HCTSIZ10_DOPNG										(0x1u<<31)
#define	OTG_HCTSIZ10_DPID										(0x3u<<29)
#define	OTG_HCTSIZ10_DPID_0										(0x1u<<29)
#define	OTG_HCTSIZ10_PKTCNT										(0x3FFu<<19)
#define	OTG_HCTSIZ10_PKTCNT_0									(0x1u<<19)
#define	OTG_HCTSIZ10_XFRSIZ										(0x7FFFFu<<0)
#define	OTG_HCTSIZ10_XFRSIZ_0									(0x1u<<0)

#define	OTG_HCTSIZ10_DPID_B_0X0									(0x0u<<29)
#define	OTG_HCTSIZ10_DPID_B_0X1									(0x1u<<29)
#define	OTG_HCTSIZ10_DPID_B_0X2									(0x2u<<29)
#define	OTG_HCTSIZ10_DPID_B_0X3									(0x3u<<29)

// HCDMA10 Configuration

#define	OTG_HCDMA10_DMAADDR										(0xFFFFFFFFu<<0)
#define	OTG_HCDMA10_DMAADDR_0									(0x1u<<0)

// HCCHAR11 Configuration

#define	OTG_HCCHAR11_CHENA										(0x1u<<31)
#define	OTG_HCCHAR11_CHDIS										(0x1u<<30)
#define	OTG_HCCHAR11_ODDFRM										(0x1u<<29)
#define	OTG_HCCHAR11_DAD										(0x7Fu<<22)
#define	OTG_HCCHAR11_DAD_0										(0x1u<<22)
#define	OTG_HCCHAR11_MCNT										(0x3u<<20)
#define	OTG_HCCHAR11_MCNT_0										(0x1u<<20)
#define	OTG_HCCHAR11_EPTYP										(0x3u<<18)
#define	OTG_HCCHAR11_EPTYP_0									(0x1u<<18)
#define	OTG_HCCHAR11_LSDEV										(0x1u<<17)
#define	OTG_HCCHAR11_EPDIR										(0x1u<<15)
#define	OTG_HCCHAR11_EPNUM										(0xFu<<11)
#define	OTG_HCCHAR11_EPNUM_0									(0x1u<<11)
#define	OTG_HCCHAR11_MPSIZ										(0x7FFu<<0)
#define	OTG_HCCHAR11_MPSIZ_0									(0x1u<<0)

