hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
#define	OTG_HCCHAR15_CHENA_B_0X0								(0x0u<<31)
#define	OTG_HCCHAR15_CHENA_B_0X1								(0x1u<<31)
#define	OTG_HCCHAR15_ODDFRM_B_0X0								(0x0u<<29)
#define	OTG_HCCHAR15_ODDFRM_B_0X1								(0x1u<<29)
#define	OTG_HCCHAR15_MCNT_B_0X1									(0x1u<<20)
#define	OTG_HCCHAR15_MCNT_B_0X2									(0x2u<<20)
#define	OTG_HCCHAR15_MCNT_B_0X3									(0x3u<<20)
#define	OTG_HCCHAR15_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_HCCHAR15_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_HCCHAR15_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_HCCHAR15_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_HCCHAR15_EPDIR_B_0X0								(0x0u<<15)
#define	OTG_HCCHAR15_EPDIR_B_0X1								(0x1u<<15)

// HCSPLT15 Configuration

#define	OTG_HCSPLT15_SPLITEN									(0x1u<<31)
#define	OTG_HCSPLT15_COMPLSPLT									(0x1u<<16)
#define	OTG_HCSPLT15_XACTPOS									(0x3u<<14)
#define	OTG_HCSPLT15_XACTPOS_0									(0x1u<<14)
#define	OTG_HCSPLT15_HUBADDR									(0x7Fu<<7)
#define	OTG_HCSPLT15_HUBADDR_0									(0x1u<<7)
#define	OTG_HCSPLT15_PRTADDR									(0x7Fu<<0)
#define	OTG_HCSPLT15_PRTADDR_0									(0x1u<<0)

#define	OTG_HCSPLT15_XACTPOS_B_0X3								(0x3u<<14)
#define	OTG_HCSPLT15_XACTPOS_B_0X2								(0x2u<<14)
#define	OTG_HCSPLT15_XACTPOS_B_0X0								(0x0u<<14)
#define	OTG_HCSPLT15_XACTPOS_B_0X1								(0x1u<<14)

// HCINT15 Configuration

#define	OTG_HCINT15_DTERR										(0x1u<<10)
#define	OTG_HCINT15_FRMOR										(0x1u<<9)
#define	OTG_HCINT15_BBERR										(0x1u<<8)
#define	OTG_HCINT15_TXERR										(0x1u<<7)
#define	OTG_HCINT15_NYET										(0x1u<<6)
#define	OTG_HCINT15_ACK											(0x1u<<5)
#define	OTG_HCINT15_NAK											(0x1u<<4)
#define	OTG_HCINT15_STALL										(0x1u<<3)
#define	OTG_HCINT15_AHBERR										(0x1u<<2)
#define	OTG_HCINT15_CHH											(0x1u<<1)
#define	OTG_HCINT15_XFRC										(0x1u<<0)

// HCINTMSK15 Configuration

#define	OTG_HCINTMSK15_DTERRM									(0x1u<<10)
#define	OTG_HCINTMSK15_FRMORM									(0x1u<<9)
#define	OTG_HCINTMSK15_BBERRM									(0x1u<<8)
#define	OTG_HCINTMSK15_TXERRM									(0x1u<<7)
#define	OTG_HCINTMSK15_NYET										(0x1u<<6)
#define	OTG_HCINTMSK15_ACKM										(0x1u<<5)
#define	OTG_HCINTMSK15_NAKM										(0x1u<<4)
#define	OTG_HCINTMSK15_STALLM									(0x1u<<3)
#define	OTG_HCINTMSK15_AHBERRM									(0x1u<<2)
#define	OTG_HCINTMSK15_CHHM										(0x1u<<1)
#define	OTG_HCINTMSK15_XFRCM									(0x1u<<0)

#define	OTG_HCINTMSK15_DTERRM_B_0X0								(0x0u<<10)
#define	OTG_HCINTMSK15_DTERRM_B_0X1								(0x1u<<10)
#define	OTG_HCINTMSK15_FRMORM_B_0X0								(0x0u<<9)
#define	OTG_HCINTMSK15_FRMORM_B_0X1								(0x1u<<9)
#define	OTG_HCINTMSK15_BBERRM_B_0X0								(0x0u<<8)
#define	OTG_HCINTMSK15_BBERRM_B_0X1								(0x1u<<8)
#define	OTG_HCINTMSK15_TXERRM_B_0X0								(0x0u<<7)
#define	OTG_HCINTMSK15_TXERRM_B_0X1								(0x1u<<7)
#define	OTG_HCINTMSK15_NYET_B_0X0								(0x0u<<6)
#define	OTG_HCINTMSK15_NYET_B_0X1								(0x1u<<6)
#define	OTG_HCINTMSK15_ACKM_B_0X0								(0x0u<<5)
#define	OTG_HCINTMSK15_ACKM_B_0X1								(0x1u<<5)
#define	OTG_HCINTMSK15_NAKM_B_0X0								(0x0u<<4)
#define	OTG_HCINTMSK15_NAKM_B_0X1								(0x1u<<4)
#define	OTG_HCINTMSK15_STALLM_B_0X0								(0x0u<<3)
#define	OTG_HCINTMSK15_STALLM_B_0X1								(0x1u<<3)
#define	OTG_HCINTMSK15_AHBERRM_B_0X0							(0x0u<<2)
#define	OTG_HCINTMSK15_AHBERRM_B_0X1							(0x1u<<2)
#define	OTG_HCINTMSK15_CHHM_B_0X0								(0x0u<<1)
#define	OTG_HCINTMSK15_CHHM_B_0X1								(0x1u<<1)
#define	OTG_HCINTMSK15_XFRCM_B_0X0								(0x0u<<0)
#define	OTG_HCINTMSK15_XFRCM_B_0X1								(0x1u<<0)

// HCTSIZ15 Configuration

#define	OTG_HCTSIZ15_DOPNG										(0x1u<<31)
#define	OTG_HCTSIZ15_DPID										(0x3u<<29)
#define	OTG_HCTSIZ15_DPID_0										(0x1u<<29)
#define	OTG_HCTSIZ15_PKTCNT										(0x3FFu<<19)
#define	OTG_HCTSIZ15_PKTCNT_0									(0x1u<<19)
#define	OTG_HCTSIZ15_XFRSIZ										(0x7FFFFu<<0)
#define	OTG_HCTSIZ15_XFRSIZ_0									(0x1u<<0)

#define	OTG_HCTSIZ15_DPID_B_0X0									(0x0u<<29)
#define	OTG_HCTSIZ15_DPID_B_0X1									(0x1u<<29)
#define	OTG_HCTSIZ15_DPID_B_0X2									(0x2u<<29)
#define	OTG_HCTSIZ15_DPID_B_0X3									(0x3u<<29)

// HCDMA15 Configuration

#define	OTG_HCDMA15_DMAADDR										(0xFFFFFFFFu<<0)
#define	OTG_HCDMA15_DMAADDR_0									(0x1u<<0)

// DCFG Configuration

#define	OTG_DCFG_PERSCHIVL										(0x3u<<24)
#define	OTG_DCFG_PERSCHIVL_0									(0x1u<<24)
#define	OTG_DCFG_ERRATIM										(0x1u<<15)
#define	OTG_DCFG_PFIVL											(0x3u<<11)
#define	OTG_DCFG_PFIVL_0										(0x1u<<11)
#define	OTG_DCFG_DAD											(0x7Fu<<4)
#define	OTG_DCFG_DAD_0											(0x1u<<4)
#define	OTG_DCFG_NZLSOHSK										(0x1u<<2)
#define	OTG_DCFG_DSPD											(0x3u<<0)
#define	OTG_DCFG_DSPD_0											(0x1u<<0)

#define	OTG_DCFG_PERSCHIVL_B_0X0								(0x0u<<24)
#define	OTG_DCFG_PERSCHIVL_B_0X1								(0x1u<<24)
#define	OTG_DCFG_PERSCHIVL_B_0X2								(0x2u<<24)
#define	OTG_DCFG_ERRATIM_B_0X1									(0x1u<<15)
#define	OTG_DCFG_ERRATIM_B_0X0									(0x0u<<15)
#define	OTG_DCFG_PFIVL_B_0X0									(0x0u<<11)
#define	OTG_DCFG_PFIVL_B_0X1									(0x1u<<11)
#define	OTG_DCFG_PFIVL_B_0X2									(0x2u<<11)
#define	OTG_DCFG_PFIVL_B_0X3									(0x3u<<11)
#define	OTG_DCFG_NZLSOHSK_B_0X1									(0x1u<<2)
#define	OTG_DCFG_NZLSOHSK_B_0X0									(0x0u<<2)
#define	OTG_DCFG_DSPD_B_0X0										(0x0u<<0)
#define	OTG_DCFG_DSPD_B_0X1										(0x1u<<0)

// DCTL Configuration

#define	OTG_DCTL_DSBESLRJCT										(0x1u<<18)
#define	OTG_DCTL_POPRGDNE										(0x1u<<11)
#define	OTG_DCTL_CGONAK											(0x1u<<10)
#define	OTG_DCTL_SGONAK											(0x1u<<9)
#define	OTG_DCTL_CGINAK											(0x1u<<8)
#define	OTG_DCTL_SGINAK											(0x1u<<7)
#define	OTG_DCTL_TCTL											(0x7u<<4)
#define	OTG_DCTL_TCTL_0											(0x1u<<4)
#define	OTG_DCTL_GONSTS											(0x1u<<3)
#define	OTG_DCTL_GINSTS											(0x1u<<2)
#define	OTG_DCTL_SDIS											(0x1u<<1)
#define	OTG_DCTL_RWUSIG											(0x1u<<0)

#define	OTG_DCTL_TCTL_B_0X0										(0x0u<<4)
#define	OTG_DCTL_TCTL_B_0X1										(0x1u<<4)
#define	OTG_DCTL_TCTL_B_0X2										(0x2u<<4)
#define	OTG_DCTL_TCTL_B_0X3										(0x3u<<4)
#define	OTG_DCTL_TCTL_B_0X4										(0x4u<<4)
#define	OTG_DCTL_TCTL_B_0X5										(0x5u<<4)
#define	OTG_DCTL_GONSTS_B_0X0									(0x0u<<3)
#define	OTG_DCTL_GONSTS_B_0X1									(0x1u<<3)
#define	OTG_DCTL_GINSTS_B_0X0									(0x0u<<2)
#define	OTG_DCTL_GINSTS_B_0X1									(0x1u<<2)
#define	OTG_DCTL_SDIS_B_0X0										(0x0u<<1)
#define	OTG_DCTL_SDIS_B_0X1										(0x1u<<1)

