hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
// DSTS Configuration

#define	OTG_DSTS_DEVLNSTS										(0x3u<<22)
#define	OTG_DSTS_DEVLNSTS_0										(0x1u<<22)
#define	OTG_DSTS_FNSOF											(0x3FFFu<<8)
#define	OTG_DSTS_FNSOF_0										(0x1u<<8)
#define	OTG_DSTS_EERR											(0x1u<<3)
#define	OTG_DSTS_ENUMSPD										(0x3u<<1)
#define	OTG_DSTS_ENUMSPD_0										(0x1u<<1)
#define	OTG_DSTS_SUSPSTS										(0x1u<<0)

#define	OTG_DSTS_ENUMSPD_B_0X0									(0x0u<<1)
#define	OTG_DSTS_ENUMSPD_B_0X1									(0x1u<<1)

// DIEPMSK Configuration

#define	OTG_DIEPMSK_NAKM										(0x1u<<13)
#define	OTG_DIEPMSK_TXFURM										(0x1u<<8)
#define	OTG_DIEPMSK_INEPNEM										(0x1u<<6)
#define	OTG_DIEPMSK_INEPNMM										(0x1u<<5)
#define	OTG_DIEPMSK_ITTXFEMSK									(0x1u<<4)
#define	OTG_DIEPMSK_TOM											(0x1u<<3)
#define	OTG_DIEPMSK_AHBERRM										(0x1u<<2)
#define	OTG_DIEPMSK_EPDM										(0x1u<<1)
#define	OTG_DIEPMSK_XFRCM										(0x1u<<0)

#define	OTG_DIEPMSK_NAKM_B_0X0									(0x0u<<13)
#define	OTG_DIEPMSK_NAKM_B_0X1									(0x1u<<13)
#define	OTG_DIEPMSK_TXFURM_B_0X0								(0x0u<<8)
#define	OTG_DIEPMSK_TXFURM_B_0X1								(0x1u<<8)
#define	OTG_DIEPMSK_INEPNEM_B_0X0								(0x0u<<6)
#define	OTG_DIEPMSK_INEPNEM_B_0X1								(0x1u<<6)
#define	OTG_DIEPMSK_INEPNMM_B_0X0								(0x0u<<5)
#define	OTG_DIEPMSK_INEPNMM_B_0X1								(0x1u<<5)
#define	OTG_DIEPMSK_ITTXFEMSK_B_0X0								(0x0u<<4)
#define	OTG_DIEPMSK_ITTXFEMSK_B_0X1								(0x1u<<4)
#define	OTG_DIEPMSK_TOM_B_0X0									(0x0u<<3)
#define	OTG_DIEPMSK_TOM_B_0X1									(0x1u<<3)
#define	OTG_DIEPMSK_AHBERRM_B_0X0								(0x0u<<2)
#define	OTG_DIEPMSK_AHBERRM_B_0X1								(0x1u<<2)
#define	OTG_DIEPMSK_EPDM_B_0X0									(0x0u<<1)
#define	OTG_DIEPMSK_EPDM_B_0X1									(0x1u<<1)
#define	OTG_DIEPMSK_XFRCM_B_0X0									(0x0u<<0)
#define	OTG_DIEPMSK_XFRCM_B_0X1									(0x1u<<0)

// DOEPMSK Configuration

#define	OTG_DOEPMSK_NYETMSK										(0x1u<<14)
#define	OTG_DOEPMSK_NAKMSK										(0x1u<<13)
#define	OTG_DOEPMSK_BERRM										(0x1u<<12)
#define	OTG_DOEPMSK_OUTPKTERRM									(0x1u<<8)
#define	OTG_DOEPMSK_B2BSTUPM									(0x1u<<6)
#define	OTG_DOEPMSK_STSPHSRXM									(0x1u<<5)
#define	OTG_DOEPMSK_OTEPDM										(0x1u<<4)
#define	OTG_DOEPMSK_STUPM										(0x1u<<3)
#define	OTG_DOEPMSK_AHBERRM										(0x1u<<2)
#define	OTG_DOEPMSK_EPDM										(0x1u<<1)
#define	OTG_DOEPMSK_XFRCM										(0x1u<<0)

#define	OTG_DOEPMSK_NYETMSK_B_0X0								(0x0u<<14)
#define	OTG_DOEPMSK_NYETMSK_B_0X1								(0x1u<<14)
#define	OTG_DOEPMSK_NAKMSK_B_0X0								(0x0u<<13)
#define	OTG_DOEPMSK_NAKMSK_B_0X1								(0x1u<<13)
#define	OTG_DOEPMSK_BERRM_B_0X0									(0x0u<<12)
#define	OTG_DOEPMSK_BERRM_B_0X1									(0x1u<<12)
#define	OTG_DOEPMSK_OUTPKTERRM_B_0X0							(0x0u<<8)
#define	OTG_DOEPMSK_OUTPKTERRM_B_0X1							(0x1u<<8)
#define	OTG_DOEPMSK_B2BSTUPM_B_0X0								(0x0u<<6)
#define	OTG_DOEPMSK_B2BSTUPM_B_0X1								(0x1u<<6)
#define	OTG_DOEPMSK_STSPHSRXM_B_0X0								(0x0u<<5)
#define	OTG_DOEPMSK_STSPHSRXM_B_0X1								(0x1u<<5)
#define	OTG_DOEPMSK_OTEPDM_B_0X0								(0x0u<<4)
#define	OTG_DOEPMSK_OTEPDM_B_0X1								(0x1u<<4)
#define	OTG_DOEPMSK_STUPM_B_0X0									(0x0u<<3)
#define	OTG_DOEPMSK_STUPM_B_0X1									(0x1u<<3)
#define	OTG_DOEPMSK_AHBERRM_B_0X0								(0x0u<<2)
#define	OTG_DOEPMSK_AHBERRM_B_0X1								(0x1u<<2)
#define	OTG_DOEPMSK_EPDM_B_0X0									(0x0u<<1)
#define	OTG_DOEPMSK_EPDM_B_0X1									(0x1u<<1)
#define	OTG_DOEPMSK_XFRCM_B_0X0									(0x0u<<0)
#define	OTG_DOEPMSK_XFRCM_B_0X1									(0x1u<<0)

// DAINT Configuration

#define	OTG_DAINT_OEPINT										(0xFFFFu<<16)
#define	OTG_DAINT_OEPINT_0										(0x1u<<16)
#define	OTG_DAINT_IEPINT										(0xFFFFu<<0)
#define	OTG_DAINT_IEPINT_0										(0x1u<<0)

// DAINTMSK Configuration

#define	OTG_DAINTMSK_OEPM										(0xFFFFu<<16)
#define	OTG_DAINTMSK_OEPM_0										(0x1u<<16)
#define	OTG_DAINTMSK_IEPM										(0xFFFFu<<0)
#define	OTG_DAINTMSK_IEPM_0										(0x1u<<0)

#define	OTG_DAINTMSK_OEPM_B_0X0									(0x0u<<16)
#define	OTG_DAINTMSK_OEPM_B_0X1									(0x1u<<16)
#define	OTG_DAINTMSK_IEPM_B_0X0									(0x0u<<0)
#define	OTG_DAINTMSK_IEPM_B_0X1									(0x1u<<0)

// DTHRCTL Configuration

#define	OTG_DTHRCTL_ARPEN										(0x1u<<27)
#define	OTG_DTHRCTL_RXTHRLEN									(0x1FFu<<17)
#define	OTG_DTHRCTL_RXTHRLEN_0									(0x1u<<17)
#define	OTG_DTHRCTL_RXTHREN										(0x1u<<16)
#define	OTG_DTHRCTL_TXTHRLEN									(0x1FFu<<2)
#define	OTG_DTHRCTL_TXTHRLEN_0									(0x1u<<2)
#define	OTG_DTHRCTL_ISOTHREN									(0x1u<<1)
#define	OTG_DTHRCTL_NONISOTHREN									(0x1u<<0)

// DIEPEMPMSK Configuration

#define	OTG_DIEPEMPMSK_INEPTXFEM								(0xFFFFu<<0)
#define	OTG_DIEPEMPMSK_INEPTXFEM_0								(0x1u<<0)

#define	OTG_DIEPEMPMSK_INEPTXFEM_B_0X0							(0x0u<<0)
#define	OTG_DIEPEMPMSK_INEPTXFEM_B_0X1							(0x1u<<0)

// DIEPCTL0 Configuration

#define	OTG_DIEPCTL0_EPENA										(0x1u<<31)
#define	OTG_DIEPCTL0_EPDIS										(0x1u<<30)
#define	OTG_DIEPCTL0_SD1PID										(0x1u<<29)
#define	OTG_DIEPCTL0_SD0PID										(0x1u<<28)
#define	OTG_DIEPCTL0_SNAK										(0x1u<<27)
#define	OTG_DIEPCTL0_CNAK										(0x1u<<26)
#define	OTG_DIEPCTL0_TXFNUM										(0xFu<<22)
#define	OTG_DIEPCTL0_TXFNUM_0									(0x1u<<22)
#define	OTG_DIEPCTL0_STALL										(0x1u<<21)
#define	OTG_DIEPCTL0_EPTYP										(0x3u<<18)
#define	OTG_DIEPCTL0_EPTYP_0									(0x1u<<18)
#define	OTG_DIEPCTL0_NAKSTS										(0x1u<<17)
#define	OTG_DIEPCTL0_DPID										(0x1u<<16)
#define	OTG_DIEPCTL0_USBAEP										(0x1u<<15)
#define	OTG_DIEPCTL0_MPSIZ										(0x7FFu<<0)
#define	OTG_DIEPCTL0_MPSIZ_0									(0x1u<<0)

#define	OTG_DIEPCTL0_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DIEPCTL0_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DIEPCTL0_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DIEPCTL0_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DIEPCTL0_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DIEPCTL0_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DIEPCTL0_DPID_B_0X0									(0x0u<<16)
#define	OTG_DIEPCTL0_DPID_B_0X1									(0x1u<<16)

// DIEPCTL0_ALTERNATE Configuration

#define	OTG_DIEPCTL0_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DIEPCTL0_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DIEPCTL0_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DIEPCTL0_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DIEPCTL0_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DIEPCTL0_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DIEPCTL0_ALTERNATE_TXFNUM							(0xFu<<22)
#define	OTG_DIEPCTL0_ALTERNATE_TXFNUM_0							(0x1u<<22)
#define	OTG_DIEPCTL0_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DIEPCTL0_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DIEPCTL0_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DIEPCTL0_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DIEPCTL0_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DIEPCTL0_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DIEPCTL0_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DIEPCTL0_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DIEPCTL0_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DIEPCTL0_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DIEPCTL0_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DIEPCTL0_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DIEPCTL0_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DIEPCTL0_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DIEPCTL0_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DIEPCTL0_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DIEPINT0 Configuration

#define	OTG_DIEPINT0_NAK										(0x1u<<13)
#define	OTG_DIEPINT0_PKTDRPSTS									(0x1u<<11)
#define	OTG_DIEPINT0_TXFIFOUDRN									(0x1u<<8)
#define	OTG_DIEPINT0_TXFE										(0x1u<<7)
#define	OTG_DIEPINT0_INEPNE										(0x1u<<6)
#define	OTG_DIEPINT0_INEPNM										(0x1u<<5)
#define	OTG_DIEPINT0_ITTXFE										(0x1u<<4)
#define	OTG_DIEPINT0_TOC										(0x1u<<3)
#define	OTG_DIEPINT0_AHBERR										(0x1u<<2)
#define	OTG_DIEPINT0_EPDISD										(0x1u<<1)
#define	OTG_DIEPINT0_XFRC										(0x1u<<0)

// DIEPTSIZ0 Configuration

#define	OTG_DIEPTSIZ0_PKTCNT									(0x3u<<19)
#define	OTG_DIEPTSIZ0_PKTCNT_0									(0x1u<<19)
#define	OTG_DIEPTSIZ0_XFRSIZ									(0x7Fu<<0)
#define	OTG_DIEPTSIZ0_XFRSIZ_0									(0x1u<<0)

