hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
// DIEPDMA0 Configuration

#define	OTG_DIEPDMA0_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DIEPDMA0_DMAADDR_0									(0x1u<<0)

// DTXFSTS0 Configuration

#define	OTG_DTXFSTS0_INEPTFSAV									(0xFFFFu<<0)
#define	OTG_DTXFSTS0_INEPTFSAV_0								(0x1u<<0)

#define	OTG_DTXFSTS0_INEPTFSAV_B_0X0							(0x0u<<0)
#define	OTG_DTXFSTS0_INEPTFSAV_B_0X1							(0x1u<<0)
#define	OTG_DTXFSTS0_INEPTFSAV_B_0X2							(0x2u<<0)

// DIEPCTL1 Configuration

#define	OTG_DIEPCTL1_EPENA										(0x1u<<31)
#define	OTG_DIEPCTL1_EPDIS										(0x1u<<30)
#define	OTG_DIEPCTL1_SD1PID										(0x1u<<29)
#define	OTG_DIEPCTL1_SD0PID										(0x1u<<28)
#define	OTG_DIEPCTL1_SNAK										(0x1u<<27)
#define	OTG_DIEPCTL1_CNAK										(0x1u<<26)
#define	OTG_DIEPCTL1_TXFNUM										(0xFu<<22)
#define	OTG_DIEPCTL1_TXFNUM_0									(0x1u<<22)
#define	OTG_DIEPCTL1_STALL										(0x1u<<21)
#define	OTG_DIEPCTL1_EPTYP										(0x3u<<18)
#define	OTG_DIEPCTL1_EPTYP_0									(0x1u<<18)
#define	OTG_DIEPCTL1_NAKSTS										(0x1u<<17)
#define	OTG_DIEPCTL1_DPID										(0x1u<<16)
#define	OTG_DIEPCTL1_USBAEP										(0x1u<<15)
#define	OTG_DIEPCTL1_MPSIZ										(0x7FFu<<0)
#define	OTG_DIEPCTL1_MPSIZ_0									(0x1u<<0)

#define	OTG_DIEPCTL1_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DIEPCTL1_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DIEPCTL1_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DIEPCTL1_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DIEPCTL1_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DIEPCTL1_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DIEPCTL1_DPID_B_0X0									(0x0u<<16)
#define	OTG_DIEPCTL1_DPID_B_0X1									(0x1u<<16)

// DIEPCTL1_ALTERNATE Configuration

#define	OTG_DIEPCTL1_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DIEPCTL1_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DIEPCTL1_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DIEPCTL1_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DIEPCTL1_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DIEPCTL1_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DIEPCTL1_ALTERNATE_TXFNUM							(0xFu<<22)
#define	OTG_DIEPCTL1_ALTERNATE_TXFNUM_0							(0x1u<<22)
#define	OTG_DIEPCTL1_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DIEPCTL1_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DIEPCTL1_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DIEPCTL1_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DIEPCTL1_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DIEPCTL1_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DIEPCTL1_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DIEPCTL1_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DIEPCTL1_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DIEPCTL1_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DIEPCTL1_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DIEPCTL1_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DIEPCTL1_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DIEPCTL1_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DIEPCTL1_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DIEPCTL1_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DIEPINT1 Configuration

#define	OTG_DIEPINT1_NAK										(0x1u<<13)
#define	OTG_DIEPINT1_PKTDRPSTS									(0x1u<<11)
#define	OTG_DIEPINT1_TXFIFOUDRN									(0x1u<<8)
#define	OTG_DIEPINT1_TXFE										(0x1u<<7)
#define	OTG_DIEPINT1_INEPNE										(0x1u<<6)
#define	OTG_DIEPINT1_INEPNM										(0x1u<<5)
#define	OTG_DIEPINT1_ITTXFE										(0x1u<<4)
#define	OTG_DIEPINT1_TOC										(0x1u<<3)
#define	OTG_DIEPINT1_AHBERR										(0x1u<<2)
#define	OTG_DIEPINT1_EPDISD										(0x1u<<1)
#define	OTG_DIEPINT1_XFRC										(0x1u<<0)

// DIEPTSIZ1 Configuration

#define	OTG_DIEPTSIZ1_MCNT										(0x3u<<29)
#define	OTG_DIEPTSIZ1_MCNT_0									(0x1u<<29)
#define	OTG_DIEPTSIZ1_PKTCNT									(0x3FFu<<19)
#define	OTG_DIEPTSIZ1_PKTCNT_0									(0x1u<<19)
#define	OTG_DIEPTSIZ1_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DIEPTSIZ1_XFRSIZ_0									(0x1u<<0)

#define	OTG_DIEPTSIZ1_MCNT_B_0X1								(0x1u<<29)
#define	OTG_DIEPTSIZ1_MCNT_B_0X2								(0x2u<<29)
#define	OTG_DIEPTSIZ1_MCNT_B_0X3								(0x3u<<29)

// DIEPDMA1 Configuration

#define	OTG_DIEPDMA1_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DIEPDMA1_DMAADDR_0									(0x1u<<0)

// DTXFSTS1 Configuration

#define	OTG_DTXFSTS1_INEPTFSAV									(0xFFFFu<<0)
#define	OTG_DTXFSTS1_INEPTFSAV_0								(0x1u<<0)

#define	OTG_DTXFSTS1_INEPTFSAV_B_0X0							(0x0u<<0)
#define	OTG_DTXFSTS1_INEPTFSAV_B_0X1							(0x1u<<0)
#define	OTG_DTXFSTS1_INEPTFSAV_B_0X2							(0x2u<<0)

// DIEPCTL2 Configuration

#define	OTG_DIEPCTL2_EPENA										(0x1u<<31)
#define	OTG_DIEPCTL2_EPDIS										(0x1u<<30)
#define	OTG_DIEPCTL2_SD1PID										(0x1u<<29)
#define	OTG_DIEPCTL2_SD0PID										(0x1u<<28)
#define	OTG_DIEPCTL2_SNAK										(0x1u<<27)
#define	OTG_DIEPCTL2_CNAK										(0x1u<<26)
#define	OTG_DIEPCTL2_TXFNUM										(0xFu<<22)
#define	OTG_DIEPCTL2_TXFNUM_0									(0x1u<<22)
#define	OTG_DIEPCTL2_STALL										(0x1u<<21)
#define	OTG_DIEPCTL2_EPTYP										(0x3u<<18)
#define	OTG_DIEPCTL2_EPTYP_0									(0x1u<<18)
#define	OTG_DIEPCTL2_NAKSTS										(0x1u<<17)
#define	OTG_DIEPCTL2_DPID										(0x1u<<16)
#define	OTG_DIEPCTL2_USBAEP										(0x1u<<15)
#define	OTG_DIEPCTL2_MPSIZ										(0x7FFu<<0)
#define	OTG_DIEPCTL2_MPSIZ_0									(0x1u<<0)

#define	OTG_DIEPCTL2_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DIEPCTL2_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DIEPCTL2_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DIEPCTL2_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DIEPCTL2_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DIEPCTL2_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DIEPCTL2_DPID_B_0X0									(0x0u<<16)
#define	OTG_DIEPCTL2_DPID_B_0X1									(0x1u<<16)

// DIEPCTL2_ALTERNATE Configuration

#define	OTG_DIEPCTL2_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DIEPCTL2_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DIEPCTL2_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DIEPCTL2_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DIEPCTL2_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DIEPCTL2_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DIEPCTL2_ALTERNATE_TXFNUM							(0xFu<<22)
#define	OTG_DIEPCTL2_ALTERNATE_TXFNUM_0							(0x1u<<22)
#define	OTG_DIEPCTL2_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DIEPCTL2_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DIEPCTL2_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DIEPCTL2_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DIEPCTL2_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DIEPCTL2_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DIEPCTL2_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DIEPCTL2_ALTERNATE_MPSIZ_0							(0x1u<<0)

