hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
#define	OTG_DIEPCTL2_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DIEPCTL2_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DIEPCTL2_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DIEPCTL2_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DIEPCTL2_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DIEPCTL2_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DIEPCTL2_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DIEPCTL2_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DIEPINT2 Configuration

#define	OTG_DIEPINT2_NAK										(0x1u<<13)
#define	OTG_DIEPINT2_PKTDRPSTS									(0x1u<<11)
#define	OTG_DIEPINT2_TXFIFOUDRN									(0x1u<<8)
#define	OTG_DIEPINT2_TXFE										(0x1u<<7)
#define	OTG_DIEPINT2_INEPNE										(0x1u<<6)
#define	OTG_DIEPINT2_INEPNM										(0x1u<<5)
#define	OTG_DIEPINT2_ITTXFE										(0x1u<<4)
#define	OTG_DIEPINT2_TOC										(0x1u<<3)
#define	OTG_DIEPINT2_AHBERR										(0x1u<<2)
#define	OTG_DIEPINT2_EPDISD										(0x1u<<1)
#define	OTG_DIEPINT2_XFRC										(0x1u<<0)

// DIEPTSIZ2 Configuration

#define	OTG_DIEPTSIZ2_MCNT										(0x3u<<29)
#define	OTG_DIEPTSIZ2_MCNT_0									(0x1u<<29)
#define	OTG_DIEPTSIZ2_PKTCNT									(0x3FFu<<19)
#define	OTG_DIEPTSIZ2_PKTCNT_0									(0x1u<<19)
#define	OTG_DIEPTSIZ2_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DIEPTSIZ2_XFRSIZ_0									(0x1u<<0)

#define	OTG_DIEPTSIZ2_MCNT_B_0X1								(0x1u<<29)
#define	OTG_DIEPTSIZ2_MCNT_B_0X2								(0x2u<<29)
#define	OTG_DIEPTSIZ2_MCNT_B_0X3								(0x3u<<29)

// DIEPDMA2 Configuration

#define	OTG_DIEPDMA2_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DIEPDMA2_DMAADDR_0									(0x1u<<0)

// DTXFSTS2 Configuration

#define	OTG_DTXFSTS2_INEPTFSAV									(0xFFFFu<<0)
#define	OTG_DTXFSTS2_INEPTFSAV_0								(0x1u<<0)

#define	OTG_DTXFSTS2_INEPTFSAV_B_0X0							(0x0u<<0)
#define	OTG_DTXFSTS2_INEPTFSAV_B_0X1							(0x1u<<0)
#define	OTG_DTXFSTS2_INEPTFSAV_B_0X2							(0x2u<<0)

// DIEPCTL3 Configuration

#define	OTG_DIEPCTL3_EPENA										(0x1u<<31)
#define	OTG_DIEPCTL3_EPDIS										(0x1u<<30)
#define	OTG_DIEPCTL3_SD1PID										(0x1u<<29)
#define	OTG_DIEPCTL3_SD0PID										(0x1u<<28)
#define	OTG_DIEPCTL3_SNAK										(0x1u<<27)
#define	OTG_DIEPCTL3_CNAK										(0x1u<<26)
#define	OTG_DIEPCTL3_TXFNUM										(0xFu<<22)
#define	OTG_DIEPCTL3_TXFNUM_0									(0x1u<<22)
#define	OTG_DIEPCTL3_STALL										(0x1u<<21)
#define	OTG_DIEPCTL3_EPTYP										(0x3u<<18)
#define	OTG_DIEPCTL3_EPTYP_0									(0x1u<<18)
#define	OTG_DIEPCTL3_NAKSTS										(0x1u<<17)
#define	OTG_DIEPCTL3_DPID										(0x1u<<16)
#define	OTG_DIEPCTL3_USBAEP										(0x1u<<15)
#define	OTG_DIEPCTL3_MPSIZ										(0x7FFu<<0)
#define	OTG_DIEPCTL3_MPSIZ_0									(0x1u<<0)

#define	OTG_DIEPCTL3_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DIEPCTL3_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DIEPCTL3_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DIEPCTL3_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DIEPCTL3_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DIEPCTL3_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DIEPCTL3_DPID_B_0X0									(0x0u<<16)
#define	OTG_DIEPCTL3_DPID_B_0X1									(0x1u<<16)

// DIEPCTL3_ALTERNATE Configuration

#define	OTG_DIEPCTL3_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DIEPCTL3_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DIEPCTL3_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DIEPCTL3_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DIEPCTL3_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DIEPCTL3_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DIEPCTL3_ALTERNATE_TXFNUM							(0xFu<<22)
#define	OTG_DIEPCTL3_ALTERNATE_TXFNUM_0							(0x1u<<22)
#define	OTG_DIEPCTL3_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DIEPCTL3_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DIEPCTL3_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DIEPCTL3_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DIEPCTL3_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DIEPCTL3_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DIEPCTL3_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DIEPCTL3_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DIEPCTL3_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DIEPCTL3_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DIEPCTL3_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DIEPCTL3_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DIEPCTL3_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DIEPCTL3_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DIEPCTL3_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DIEPCTL3_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DIEPINT3 Configuration

#define	OTG_DIEPINT3_NAK										(0x1u<<13)
#define	OTG_DIEPINT3_PKTDRPSTS									(0x1u<<11)
#define	OTG_DIEPINT3_TXFIFOUDRN									(0x1u<<8)
#define	OTG_DIEPINT3_TXFE										(0x1u<<7)
#define	OTG_DIEPINT3_INEPNE										(0x1u<<6)
#define	OTG_DIEPINT3_INEPNM										(0x1u<<5)
#define	OTG_DIEPINT3_ITTXFE										(0x1u<<4)
#define	OTG_DIEPINT3_TOC										(0x1u<<3)
#define	OTG_DIEPINT3_AHBERR										(0x1u<<2)
#define	OTG_DIEPINT3_EPDISD										(0x1u<<1)
#define	OTG_DIEPINT3_XFRC										(0x1u<<0)

// DIEPTSIZ3 Configuration

#define	OTG_DIEPTSIZ3_MCNT										(0x3u<<29)
#define	OTG_DIEPTSIZ3_MCNT_0									(0x1u<<29)
#define	OTG_DIEPTSIZ3_PKTCNT									(0x3FFu<<19)
#define	OTG_DIEPTSIZ3_PKTCNT_0									(0x1u<<19)
#define	OTG_DIEPTSIZ3_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DIEPTSIZ3_XFRSIZ_0									(0x1u<<0)

#define	OTG_DIEPTSIZ3_MCNT_B_0X1								(0x1u<<29)
#define	OTG_DIEPTSIZ3_MCNT_B_0X2								(0x2u<<29)
#define	OTG_DIEPTSIZ3_MCNT_B_0X3								(0x3u<<29)

// DIEPDMA3 Configuration

#define	OTG_DIEPDMA3_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DIEPDMA3_DMAADDR_0									(0x1u<<0)

// DTXFSTS3 Configuration

#define	OTG_DTXFSTS3_INEPTFSAV									(0xFFFFu<<0)
#define	OTG_DTXFSTS3_INEPTFSAV_0								(0x1u<<0)

#define	OTG_DTXFSTS3_INEPTFSAV_B_0X0							(0x0u<<0)
#define	OTG_DTXFSTS3_INEPTFSAV_B_0X1							(0x1u<<0)
#define	OTG_DTXFSTS3_INEPTFSAV_B_0X2							(0x2u<<0)

// DIEPCTL4 Configuration

#define	OTG_DIEPCTL4_EPENA										(0x1u<<31)
#define	OTG_DIEPCTL4_EPDIS										(0x1u<<30)
#define	OTG_DIEPCTL4_SD1PID										(0x1u<<29)
#define	OTG_DIEPCTL4_SD0PID										(0x1u<<28)
#define	OTG_DIEPCTL4_SNAK										(0x1u<<27)
#define	OTG_DIEPCTL4_CNAK										(0x1u<<26)
#define	OTG_DIEPCTL4_TXFNUM										(0xFu<<22)
#define	OTG_DIEPCTL4_TXFNUM_0									(0x1u<<22)
#define	OTG_DIEPCTL4_STALL										(0x1u<<21)
#define	OTG_DIEPCTL4_EPTYP										(0x3u<<18)
#define	OTG_DIEPCTL4_EPTYP_0									(0x1u<<18)
#define	OTG_DIEPCTL4_NAKSTS										(0x1u<<17)
#define	OTG_DIEPCTL4_DPID										(0x1u<<16)
#define	OTG_DIEPCTL4_USBAEP										(0x1u<<15)
#define	OTG_DIEPCTL4_MPSIZ										(0x7FFu<<0)
#define	OTG_DIEPCTL4_MPSIZ_0									(0x1u<<0)

#define	OTG_DIEPCTL4_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DIEPCTL4_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DIEPCTL4_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DIEPCTL4_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DIEPCTL4_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DIEPCTL4_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DIEPCTL4_DPID_B_0X0									(0x0u<<16)
#define	OTG_DIEPCTL4_DPID_B_0X1									(0x1u<<16)

// DIEPCTL4_ALTERNATE Configuration

#define	OTG_DIEPCTL4_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DIEPCTL4_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DIEPCTL4_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DIEPCTL4_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DIEPCTL4_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DIEPCTL4_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DIEPCTL4_ALTERNATE_TXFNUM							(0xFu<<22)
#define	OTG_DIEPCTL4_ALTERNATE_TXFNUM_0							(0x1u<<22)
#define	OTG_DIEPCTL4_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DIEPCTL4_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DIEPCTL4_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DIEPCTL4_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DIEPCTL4_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DIEPCTL4_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DIEPCTL4_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DIEPCTL4_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DIEPCTL4_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DIEPCTL4_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DIEPCTL4_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DIEPCTL4_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DIEPCTL4_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DIEPCTL4_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DIEPCTL4_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DIEPCTL4_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

