hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
// DIEPINT4 Configuration

#define	OTG_DIEPINT4_NAK										(0x1u<<13)
#define	OTG_DIEPINT4_PKTDRPSTS									(0x1u<<11)
#define	OTG_DIEPINT4_TXFIFOUDRN									(0x1u<<8)
#define	OTG_DIEPINT4_TXFE										(0x1u<<7)
#define	OTG_DIEPINT4_INEPNE										(0x1u<<6)
#define	OTG_DIEPINT4_INEPNM										(0x1u<<5)
#define	OTG_DIEPINT4_ITTXFE										(0x1u<<4)
#define	OTG_DIEPINT4_TOC										(0x1u<<3)
#define	OTG_DIEPINT4_AHBERR										(0x1u<<2)
#define	OTG_DIEPINT4_EPDISD										(0x1u<<1)
#define	OTG_DIEPINT4_XFRC										(0x1u<<0)

// DIEPTSIZ4 Configuration

#define	OTG_DIEPTSIZ4_MCNT										(0x3u<<29)
#define	OTG_DIEPTSIZ4_MCNT_0									(0x1u<<29)
#define	OTG_DIEPTSIZ4_PKTCNT									(0x3FFu<<19)
#define	OTG_DIEPTSIZ4_PKTCNT_0									(0x1u<<19)
#define	OTG_DIEPTSIZ4_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DIEPTSIZ4_XFRSIZ_0									(0x1u<<0)

#define	OTG_DIEPTSIZ4_MCNT_B_0X1								(0x1u<<29)
#define	OTG_DIEPTSIZ4_MCNT_B_0X2								(0x2u<<29)
#define	OTG_DIEPTSIZ4_MCNT_B_0X3								(0x3u<<29)

// DIEPDMA4 Configuration

#define	OTG_DIEPDMA4_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DIEPDMA4_DMAADDR_0									(0x1u<<0)

// DTXFSTS4 Configuration

#define	OTG_DTXFSTS4_INEPTFSAV									(0xFFFFu<<0)
#define	OTG_DTXFSTS4_INEPTFSAV_0								(0x1u<<0)

#define	OTG_DTXFSTS4_INEPTFSAV_B_0X0							(0x0u<<0)
#define	OTG_DTXFSTS4_INEPTFSAV_B_0X1							(0x1u<<0)
#define	OTG_DTXFSTS4_INEPTFSAV_B_0X2							(0x2u<<0)

// DIEPCTL5 Configuration

#define	OTG_DIEPCTL5_EPENA										(0x1u<<31)
#define	OTG_DIEPCTL5_EPDIS										(0x1u<<30)
#define	OTG_DIEPCTL5_SD1PID										(0x1u<<29)
#define	OTG_DIEPCTL5_SD0PID										(0x1u<<28)
#define	OTG_DIEPCTL5_SNAK										(0x1u<<27)
#define	OTG_DIEPCTL5_CNAK										(0x1u<<26)
#define	OTG_DIEPCTL5_TXFNUM										(0xFu<<22)
#define	OTG_DIEPCTL5_TXFNUM_0									(0x1u<<22)
#define	OTG_DIEPCTL5_STALL										(0x1u<<21)
#define	OTG_DIEPCTL5_EPTYP										(0x3u<<18)
#define	OTG_DIEPCTL5_EPTYP_0									(0x1u<<18)
#define	OTG_DIEPCTL5_NAKSTS										(0x1u<<17)
#define	OTG_DIEPCTL5_DPID										(0x1u<<16)
#define	OTG_DIEPCTL5_USBAEP										(0x1u<<15)
#define	OTG_DIEPCTL5_MPSIZ										(0x7FFu<<0)
#define	OTG_DIEPCTL5_MPSIZ_0									(0x1u<<0)

#define	OTG_DIEPCTL5_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DIEPCTL5_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DIEPCTL5_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DIEPCTL5_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DIEPCTL5_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DIEPCTL5_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DIEPCTL5_DPID_B_0X0									(0x0u<<16)
#define	OTG_DIEPCTL5_DPID_B_0X1									(0x1u<<16)

// DIEPCTL5_ALTERNATE Configuration

#define	OTG_DIEPCTL5_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DIEPCTL5_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DIEPCTL5_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DIEPCTL5_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DIEPCTL5_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DIEPCTL5_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DIEPCTL5_ALTERNATE_TXFNUM							(0xFu<<22)
#define	OTG_DIEPCTL5_ALTERNATE_TXFNUM_0							(0x1u<<22)
#define	OTG_DIEPCTL5_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DIEPCTL5_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DIEPCTL5_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DIEPCTL5_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DIEPCTL5_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DIEPCTL5_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DIEPCTL5_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DIEPCTL5_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DIEPCTL5_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DIEPCTL5_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DIEPCTL5_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DIEPCTL5_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DIEPCTL5_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DIEPCTL5_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DIEPCTL5_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DIEPCTL5_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DIEPINT5 Configuration

#define	OTG_DIEPINT5_NAK										(0x1u<<13)
#define	OTG_DIEPINT5_PKTDRPSTS									(0x1u<<11)
#define	OTG_DIEPINT5_TXFIFOUDRN									(0x1u<<8)
#define	OTG_DIEPINT5_TXFE										(0x1u<<7)
#define	OTG_DIEPINT5_INEPNE										(0x1u<<6)
#define	OTG_DIEPINT5_INEPNM										(0x1u<<5)
#define	OTG_DIEPINT5_ITTXFE										(0x1u<<4)
#define	OTG_DIEPINT5_TOC										(0x1u<<3)
#define	OTG_DIEPINT5_AHBERR										(0x1u<<2)
#define	OTG_DIEPINT5_EPDISD										(0x1u<<1)
#define	OTG_DIEPINT5_XFRC										(0x1u<<0)

// DIEPTSIZ5 Configuration

#define	OTG_DIEPTSIZ5_MCNT										(0x3u<<29)
#define	OTG_DIEPTSIZ5_MCNT_0									(0x1u<<29)
#define	OTG_DIEPTSIZ5_PKTCNT									(0x3FFu<<19)
#define	OTG_DIEPTSIZ5_PKTCNT_0									(0x1u<<19)
#define	OTG_DIEPTSIZ5_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DIEPTSIZ5_XFRSIZ_0									(0x1u<<0)

#define	OTG_DIEPTSIZ5_MCNT_B_0X1								(0x1u<<29)
#define	OTG_DIEPTSIZ5_MCNT_B_0X2								(0x2u<<29)
#define	OTG_DIEPTSIZ5_MCNT_B_0X3								(0x3u<<29)

// DIEPDMA5 Configuration

#define	OTG_DIEPDMA5_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DIEPDMA5_DMAADDR_0									(0x1u<<0)

// DTXFSTS5 Configuration

#define	OTG_DTXFSTS5_INEPTFSAV									(0xFFFFu<<0)
#define	OTG_DTXFSTS5_INEPTFSAV_0								(0x1u<<0)

#define	OTG_DTXFSTS5_INEPTFSAV_B_0X0							(0x0u<<0)
#define	OTG_DTXFSTS5_INEPTFSAV_B_0X1							(0x1u<<0)
#define	OTG_DTXFSTS5_INEPTFSAV_B_0X2							(0x2u<<0)

// DIEPCTL6 Configuration

#define	OTG_DIEPCTL6_EPENA										(0x1u<<31)
#define	OTG_DIEPCTL6_EPDIS										(0x1u<<30)
#define	OTG_DIEPCTL6_SD1PID										(0x1u<<29)
#define	OTG_DIEPCTL6_SD0PID										(0x1u<<28)
#define	OTG_DIEPCTL6_SNAK										(0x1u<<27)
#define	OTG_DIEPCTL6_CNAK										(0x1u<<26)
#define	OTG_DIEPCTL6_TXFNUM										(0xFu<<22)
#define	OTG_DIEPCTL6_TXFNUM_0									(0x1u<<22)
#define	OTG_DIEPCTL6_STALL										(0x1u<<21)
#define	OTG_DIEPCTL6_EPTYP										(0x3u<<18)
#define	OTG_DIEPCTL6_EPTYP_0									(0x1u<<18)
#define	OTG_DIEPCTL6_NAKSTS										(0x1u<<17)
#define	OTG_DIEPCTL6_DPID										(0x1u<<16)
#define	OTG_DIEPCTL6_USBAEP										(0x1u<<15)
#define	OTG_DIEPCTL6_MPSIZ										(0x7FFu<<0)
#define	OTG_DIEPCTL6_MPSIZ_0									(0x1u<<0)

