hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
#define	OTG_DIEPCTL6_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DIEPCTL6_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DIEPCTL6_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DIEPCTL6_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DIEPCTL6_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DIEPCTL6_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DIEPCTL6_DPID_B_0X0									(0x0u<<16)
#define	OTG_DIEPCTL6_DPID_B_0X1									(0x1u<<16)

// DIEPCTL6_ALTERNATE Configuration

#define	OTG_DIEPCTL6_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DIEPCTL6_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DIEPCTL6_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DIEPCTL6_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DIEPCTL6_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DIEPCTL6_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DIEPCTL6_ALTERNATE_TXFNUM							(0xFu<<22)
#define	OTG_DIEPCTL6_ALTERNATE_TXFNUM_0							(0x1u<<22)
#define	OTG_DIEPCTL6_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DIEPCTL6_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DIEPCTL6_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DIEPCTL6_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DIEPCTL6_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DIEPCTL6_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DIEPCTL6_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DIEPCTL6_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DIEPCTL6_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DIEPCTL6_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DIEPCTL6_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DIEPCTL6_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DIEPCTL6_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DIEPCTL6_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DIEPCTL6_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DIEPCTL6_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DIEPINT6 Configuration

#define	OTG_DIEPINT6_NAK										(0x1u<<13)
#define	OTG_DIEPINT6_PKTDRPSTS									(0x1u<<11)
#define	OTG_DIEPINT6_TXFIFOUDRN									(0x1u<<8)
#define	OTG_DIEPINT6_TXFE										(0x1u<<7)
#define	OTG_DIEPINT6_INEPNE										(0x1u<<6)
#define	OTG_DIEPINT6_INEPNM										(0x1u<<5)
#define	OTG_DIEPINT6_ITTXFE										(0x1u<<4)
#define	OTG_DIEPINT6_TOC										(0x1u<<3)
#define	OTG_DIEPINT6_AHBERR										(0x1u<<2)
#define	OTG_DIEPINT6_EPDISD										(0x1u<<1)
#define	OTG_DIEPINT6_XFRC										(0x1u<<0)

// DIEPTSIZ6 Configuration

#define	OTG_DIEPTSIZ6_MCNT										(0x3u<<29)
#define	OTG_DIEPTSIZ6_MCNT_0									(0x1u<<29)
#define	OTG_DIEPTSIZ6_PKTCNT									(0x3FFu<<19)
#define	OTG_DIEPTSIZ6_PKTCNT_0									(0x1u<<19)
#define	OTG_DIEPTSIZ6_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DIEPTSIZ6_XFRSIZ_0									(0x1u<<0)

#define	OTG_DIEPTSIZ6_MCNT_B_0X1								(0x1u<<29)
#define	OTG_DIEPTSIZ6_MCNT_B_0X2								(0x2u<<29)
#define	OTG_DIEPTSIZ6_MCNT_B_0X3								(0x3u<<29)

// DIEPDMA6 Configuration

#define	OTG_DIEPDMA6_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DIEPDMA6_DMAADDR_0									(0x1u<<0)

// DTXFSTS6 Configuration

#define	OTG_DTXFSTS6_INEPTFSAV									(0xFFFFu<<0)
#define	OTG_DTXFSTS6_INEPTFSAV_0								(0x1u<<0)

#define	OTG_DTXFSTS6_INEPTFSAV_B_0X0							(0x0u<<0)
#define	OTG_DTXFSTS6_INEPTFSAV_B_0X1							(0x1u<<0)
#define	OTG_DTXFSTS6_INEPTFSAV_B_0X2							(0x2u<<0)

// DIEPCTL7 Configuration

#define	OTG_DIEPCTL7_EPENA										(0x1u<<31)
#define	OTG_DIEPCTL7_EPDIS										(0x1u<<30)
#define	OTG_DIEPCTL7_SD1PID										(0x1u<<29)
#define	OTG_DIEPCTL7_SD0PID										(0x1u<<28)
#define	OTG_DIEPCTL7_SNAK										(0x1u<<27)
#define	OTG_DIEPCTL7_CNAK										(0x1u<<26)
#define	OTG_DIEPCTL7_TXFNUM										(0xFu<<22)
#define	OTG_DIEPCTL7_TXFNUM_0									(0x1u<<22)
#define	OTG_DIEPCTL7_STALL										(0x1u<<21)
#define	OTG_DIEPCTL7_EPTYP										(0x3u<<18)
#define	OTG_DIEPCTL7_EPTYP_0									(0x1u<<18)
#define	OTG_DIEPCTL7_NAKSTS										(0x1u<<17)
#define	OTG_DIEPCTL7_DPID										(0x1u<<16)
#define	OTG_DIEPCTL7_USBAEP										(0x1u<<15)
#define	OTG_DIEPCTL7_MPSIZ										(0x7FFu<<0)
#define	OTG_DIEPCTL7_MPSIZ_0									(0x1u<<0)

#define	OTG_DIEPCTL7_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DIEPCTL7_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DIEPCTL7_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DIEPCTL7_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DIEPCTL7_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DIEPCTL7_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DIEPCTL7_DPID_B_0X0									(0x0u<<16)
#define	OTG_DIEPCTL7_DPID_B_0X1									(0x1u<<16)

// DIEPCTL7_ALTERNATE Configuration

#define	OTG_DIEPCTL7_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DIEPCTL7_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DIEPCTL7_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DIEPCTL7_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DIEPCTL7_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DIEPCTL7_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DIEPCTL7_ALTERNATE_TXFNUM							(0xFu<<22)
#define	OTG_DIEPCTL7_ALTERNATE_TXFNUM_0							(0x1u<<22)
#define	OTG_DIEPCTL7_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DIEPCTL7_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DIEPCTL7_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DIEPCTL7_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DIEPCTL7_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DIEPCTL7_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DIEPCTL7_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DIEPCTL7_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DIEPCTL7_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DIEPCTL7_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DIEPCTL7_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DIEPCTL7_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DIEPCTL7_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DIEPCTL7_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DIEPCTL7_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DIEPCTL7_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DIEPINT7 Configuration

#define	OTG_DIEPINT7_NAK										(0x1u<<13)
#define	OTG_DIEPINT7_PKTDRPSTS									(0x1u<<11)
#define	OTG_DIEPINT7_TXFIFOUDRN									(0x1u<<8)
#define	OTG_DIEPINT7_TXFE										(0x1u<<7)
#define	OTG_DIEPINT7_INEPNE										(0x1u<<6)
#define	OTG_DIEPINT7_INEPNM										(0x1u<<5)
#define	OTG_DIEPINT7_ITTXFE										(0x1u<<4)
#define	OTG_DIEPINT7_TOC										(0x1u<<3)
#define	OTG_DIEPINT7_AHBERR										(0x1u<<2)
#define	OTG_DIEPINT7_EPDISD										(0x1u<<1)
#define	OTG_DIEPINT7_XFRC										(0x1u<<0)

// DIEPTSIZ7 Configuration

#define	OTG_DIEPTSIZ7_MCNT										(0x3u<<29)
#define	OTG_DIEPTSIZ7_MCNT_0									(0x1u<<29)
#define	OTG_DIEPTSIZ7_PKTCNT									(0x3FFu<<19)
#define	OTG_DIEPTSIZ7_PKTCNT_0									(0x1u<<19)
#define	OTG_DIEPTSIZ7_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DIEPTSIZ7_XFRSIZ_0									(0x1u<<0)

#define	OTG_DIEPTSIZ7_MCNT_B_0X1								(0x1u<<29)
#define	OTG_DIEPTSIZ7_MCNT_B_0X2								(0x2u<<29)
#define	OTG_DIEPTSIZ7_MCNT_B_0X3								(0x3u<<29)

// DIEPDMA7 Configuration

#define	OTG_DIEPDMA7_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DIEPDMA7_DMAADDR_0									(0x1u<<0)

// DTXFSTS7 Configuration

#define	OTG_DTXFSTS7_INEPTFSAV									(0xFFFFu<<0)
#define	OTG_DTXFSTS7_INEPTFSAV_0								(0x1u<<0)

#define	OTG_DTXFSTS7_INEPTFSAV_B_0X0							(0x0u<<0)
#define	OTG_DTXFSTS7_INEPTFSAV_B_0X1							(0x1u<<0)
#define	OTG_DTXFSTS7_INEPTFSAV_B_0X2							(0x2u<<0)

// DIEPCTL8 Configuration

#define	OTG_DIEPCTL8_EPENA										(0x1u<<31)
#define	OTG_DIEPCTL8_EPDIS										(0x1u<<30)
#define	OTG_DIEPCTL8_SD1PID										(0x1u<<29)
#define	OTG_DIEPCTL8_SD0PID										(0x1u<<28)
#define	OTG_DIEPCTL8_SNAK										(0x1u<<27)
#define	OTG_DIEPCTL8_CNAK										(0x1u<<26)
#define	OTG_DIEPCTL8_TXFNUM										(0xFu<<22)
#define	OTG_DIEPCTL8_TXFNUM_0									(0x1u<<22)
#define	OTG_DIEPCTL8_STALL										(0x1u<<21)
#define	OTG_DIEPCTL8_EPTYP										(0x3u<<18)
#define	OTG_DIEPCTL8_EPTYP_0									(0x1u<<18)
#define	OTG_DIEPCTL8_NAKSTS										(0x1u<<17)
#define	OTG_DIEPCTL8_DPID										(0x1u<<16)
#define	OTG_DIEPCTL8_USBAEP										(0x1u<<15)
#define	OTG_DIEPCTL8_MPSIZ										(0x7FFu<<0)
#define	OTG_DIEPCTL8_MPSIZ_0									(0x1u<<0)

#define	OTG_DIEPCTL8_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DIEPCTL8_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DIEPCTL8_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DIEPCTL8_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DIEPCTL8_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DIEPCTL8_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DIEPCTL8_DPID_B_0X0									(0x0u<<16)
#define	OTG_DIEPCTL8_DPID_B_0X1									(0x1u<<16)

// DIEPCTL8_ALTERNATE Configuration

#define	OTG_DIEPCTL8_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DIEPCTL8_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DIEPCTL8_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DIEPCTL8_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DIEPCTL8_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DIEPCTL8_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DIEPCTL8_ALTERNATE_TXFNUM							(0xFu<<22)
#define	OTG_DIEPCTL8_ALTERNATE_TXFNUM_0							(0x1u<<22)
#define	OTG_DIEPCTL8_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DIEPCTL8_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DIEPCTL8_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DIEPCTL8_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DIEPCTL8_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DIEPCTL8_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DIEPCTL8_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DIEPCTL8_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DIEPCTL8_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DIEPCTL8_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DIEPCTL8_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DIEPCTL8_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DIEPCTL8_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DIEPCTL8_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DIEPCTL8_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DIEPCTL8_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

