hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
// DIEPINT8 Configuration

#define	OTG_DIEPINT8_NAK										(0x1u<<13)
#define	OTG_DIEPINT8_PKTDRPSTS									(0x1u<<11)
#define	OTG_DIEPINT8_TXFIFOUDRN									(0x1u<<8)
#define	OTG_DIEPINT8_TXFE										(0x1u<<7)
#define	OTG_DIEPINT8_INEPNE										(0x1u<<6)
#define	OTG_DIEPINT8_INEPNM										(0x1u<<5)
#define	OTG_DIEPINT8_ITTXFE										(0x1u<<4)
#define	OTG_DIEPINT8_TOC										(0x1u<<3)
#define	OTG_DIEPINT8_AHBERR										(0x1u<<2)
#define	OTG_DIEPINT8_EPDISD										(0x1u<<1)
#define	OTG_DIEPINT8_XFRC										(0x1u<<0)

// DIEPTSIZ8 Configuration

#define	OTG_DIEPTSIZ8_MCNT										(0x3u<<29)
#define	OTG_DIEPTSIZ8_MCNT_0									(0x1u<<29)
#define	OTG_DIEPTSIZ8_PKTCNT									(0x3FFu<<19)
#define	OTG_DIEPTSIZ8_PKTCNT_0									(0x1u<<19)
#define	OTG_DIEPTSIZ8_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DIEPTSIZ8_XFRSIZ_0									(0x1u<<0)

#define	OTG_DIEPTSIZ8_MCNT_B_0X1								(0x1u<<29)
#define	OTG_DIEPTSIZ8_MCNT_B_0X2								(0x2u<<29)
#define	OTG_DIEPTSIZ8_MCNT_B_0X3								(0x3u<<29)

// DIEPDMA8 Configuration

#define	OTG_DIEPDMA8_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DIEPDMA8_DMAADDR_0									(0x1u<<0)

// DTXFSTS8 Configuration

#define	OTG_DTXFSTS8_INEPTFSAV									(0xFFFFu<<0)
#define	OTG_DTXFSTS8_INEPTFSAV_0								(0x1u<<0)

#define	OTG_DTXFSTS8_INEPTFSAV_B_0X0							(0x0u<<0)
#define	OTG_DTXFSTS8_INEPTFSAV_B_0X1							(0x1u<<0)
#define	OTG_DTXFSTS8_INEPTFSAV_B_0X2							(0x2u<<0)

// DOEPCTL0 Configuration

#define	OTG_DOEPCTL0_EPENA										(0x1u<<31)
#define	OTG_DOEPCTL0_EPDIS										(0x1u<<30)
#define	OTG_DOEPCTL0_SNAK										(0x1u<<27)
#define	OTG_DOEPCTL0_CNAK										(0x1u<<26)
#define	OTG_DOEPCTL0_STALL										(0x1u<<21)
#define	OTG_DOEPCTL0_SNPM										(0x1u<<20)
#define	OTG_DOEPCTL0_EPTYP										(0x3u<<18)
#define	OTG_DOEPCTL0_EPTYP_0									(0x1u<<18)
#define	OTG_DOEPCTL0_NAKSTS										(0x1u<<17)
#define	OTG_DOEPCTL0_USBAEP										(0x1u<<15)
#define	OTG_DOEPCTL0_MPSIZ										(0x3u<<0)
#define	OTG_DOEPCTL0_MPSIZ_0									(0x1u<<0)

#define	OTG_DOEPCTL0_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DOEPCTL0_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DOEPCTL0_MPSIZ_B_0X0								(0x0u<<0)
#define	OTG_DOEPCTL0_MPSIZ_B_0X1								(0x1u<<0)
#define	OTG_DOEPCTL0_MPSIZ_B_0X2								(0x2u<<0)
#define	OTG_DOEPCTL0_MPSIZ_B_0X3								(0x3u<<0)

// DOEPINT0 Configuration

#define	OTG_DOEPINT0_STPKTRX									(0x1u<<15)
#define	OTG_DOEPINT0_NYET										(0x1u<<14)
#define	OTG_DOEPINT0_NAK										(0x1u<<13)
#define	OTG_DOEPINT0_BERR										(0x1u<<12)
#define	OTG_DOEPINT0_OUTPKTERR									(0x1u<<8)
#define	OTG_DOEPINT0_B2BSTUP									(0x1u<<6)
#define	OTG_DOEPINT0_STSPHSRX									(0x1u<<5)
#define	OTG_DOEPINT0_OTEPDIS									(0x1u<<4)
#define	OTG_DOEPINT0_STUP										(0x1u<<3)
#define	OTG_DOEPINT0_AHBERR										(0x1u<<2)
#define	OTG_DOEPINT0_EPDISD										(0x1u<<1)
#define	OTG_DOEPINT0_XFRC										(0x1u<<0)

// DOEPTSIZ0 Configuration

#define	OTG_DOEPTSIZ0_STUPCNT									(0x3u<<29)
#define	OTG_DOEPTSIZ0_STUPCNT_0									(0x1u<<29)
#define	OTG_DOEPTSIZ0_PKTCNT									(0x1u<<19)
#define	OTG_DOEPTSIZ0_XFRSIZ									(0x7Fu<<0)
#define	OTG_DOEPTSIZ0_XFRSIZ_0									(0x1u<<0)

#define	OTG_DOEPTSIZ0_STUPCNT_B_0X1								(0x1u<<29)
#define	OTG_DOEPTSIZ0_STUPCNT_B_0X2								(0x2u<<29)
#define	OTG_DOEPTSIZ0_STUPCNT_B_0X3								(0x3u<<29)

// DOEPDMA0 Configuration

#define	OTG_DOEPDMA0_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DOEPDMA0_DMAADDR_0									(0x1u<<0)

// DOEPCTL1 Configuration

#define	OTG_DOEPCTL1_EPENA										(0x1u<<31)
#define	OTG_DOEPCTL1_EPDIS										(0x1u<<30)
#define	OTG_DOEPCTL1_SD1PID										(0x1u<<29)
#define	OTG_DOEPCTL1_SD0PID										(0x1u<<28)
#define	OTG_DOEPCTL1_SNAK										(0x1u<<27)
#define	OTG_DOEPCTL1_CNAK										(0x1u<<26)
#define	OTG_DOEPCTL1_STALL										(0x1u<<21)
#define	OTG_DOEPCTL1_SNPM										(0x1u<<20)
#define	OTG_DOEPCTL1_EPTYP										(0x3u<<18)
#define	OTG_DOEPCTL1_EPTYP_0									(0x1u<<18)
#define	OTG_DOEPCTL1_NAKSTS										(0x1u<<17)
#define	OTG_DOEPCTL1_DPID										(0x1u<<16)
#define	OTG_DOEPCTL1_USBAEP										(0x1u<<15)
#define	OTG_DOEPCTL1_MPSIZ										(0x7FFu<<0)
#define	OTG_DOEPCTL1_MPSIZ_0									(0x1u<<0)

#define	OTG_DOEPCTL1_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DOEPCTL1_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DOEPCTL1_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DOEPCTL1_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DOEPCTL1_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DOEPCTL1_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DOEPCTL1_DPID_B_0X0									(0x0u<<16)
#define	OTG_DOEPCTL1_DPID_B_0X1									(0x1u<<16)

// DOEPCTL1_ALTERNATE Configuration

#define	OTG_DOEPCTL1_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DOEPCTL1_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DOEPCTL1_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DOEPCTL1_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DOEPCTL1_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DOEPCTL1_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DOEPCTL1_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DOEPCTL1_ALTERNATE_SNPM								(0x1u<<20)
#define	OTG_DOEPCTL1_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DOEPCTL1_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DOEPCTL1_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DOEPCTL1_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DOEPCTL1_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DOEPCTL1_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DOEPCTL1_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DOEPCTL1_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DOEPCTL1_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DOEPCTL1_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DOEPCTL1_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DOEPCTL1_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DOEPCTL1_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DOEPCTL1_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DOEPCTL1_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DOEPINT1 Configuration

#define	OTG_DOEPINT1_STPKTRX									(0x1u<<15)
#define	OTG_DOEPINT1_NYET										(0x1u<<14)
#define	OTG_DOEPINT1_NAK										(0x1u<<13)
#define	OTG_DOEPINT1_BERR										(0x1u<<12)
#define	OTG_DOEPINT1_OUTPKTERR									(0x1u<<8)
#define	OTG_DOEPINT1_B2BSTUP									(0x1u<<6)
#define	OTG_DOEPINT1_STSPHSRX									(0x1u<<5)
#define	OTG_DOEPINT1_OTEPDIS									(0x1u<<4)
#define	OTG_DOEPINT1_STUP										(0x1u<<3)
#define	OTG_DOEPINT1_AHBERR										(0x1u<<2)
#define	OTG_DOEPINT1_EPDISD										(0x1u<<1)
#define	OTG_DOEPINT1_XFRC										(0x1u<<0)

// DOEPTSIZ1 Configuration

#define	OTG_DOEPTSIZ1_RXDPID									(0x3u<<29)
#define	OTG_DOEPTSIZ1_RXDPID_0									(0x1u<<29)
#define	OTG_DOEPTSIZ1_PKTCNT									(0x3FFu<<19)
#define	OTG_DOEPTSIZ1_PKTCNT_0									(0x1u<<19)
#define	OTG_DOEPTSIZ1_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DOEPTSIZ1_XFRSIZ_0									(0x1u<<0)

#define	OTG_DOEPTSIZ1_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS	(0x0u<<29)
#define	OTG_DOEPTSIZ1_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS	(0x1u<<29)
#define	OTG_DOEPTSIZ1_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS	(0x2u<<29)
#define	OTG_DOEPTSIZ1_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS	(0x3u<<29)

// DOEPDMA1 Configuration

#define	OTG_DOEPDMA1_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DOEPDMA1_DMAADDR_0									(0x1u<<0)

// DOEPCTL2 Configuration

