hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
#define	OTG_DOEPCTL2_EPENA										(0x1u<<31)
#define	OTG_DOEPCTL2_EPDIS										(0x1u<<30)
#define	OTG_DOEPCTL2_SD1PID										(0x1u<<29)
#define	OTG_DOEPCTL2_SD0PID										(0x1u<<28)
#define	OTG_DOEPCTL2_SNAK										(0x1u<<27)
#define	OTG_DOEPCTL2_CNAK										(0x1u<<26)
#define	OTG_DOEPCTL2_STALL										(0x1u<<21)
#define	OTG_DOEPCTL2_SNPM										(0x1u<<20)
#define	OTG_DOEPCTL2_EPTYP										(0x3u<<18)
#define	OTG_DOEPCTL2_EPTYP_0									(0x1u<<18)
#define	OTG_DOEPCTL2_NAKSTS										(0x1u<<17)
#define	OTG_DOEPCTL2_DPID										(0x1u<<16)
#define	OTG_DOEPCTL2_USBAEP										(0x1u<<15)
#define	OTG_DOEPCTL2_MPSIZ										(0x7FFu<<0)
#define	OTG_DOEPCTL2_MPSIZ_0									(0x1u<<0)

#define	OTG_DOEPCTL2_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DOEPCTL2_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DOEPCTL2_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DOEPCTL2_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DOEPCTL2_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DOEPCTL2_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DOEPCTL2_DPID_B_0X0									(0x0u<<16)
#define	OTG_DOEPCTL2_DPID_B_0X1									(0x1u<<16)

// DOEPCTL2_ALTERNATE Configuration

#define	OTG_DOEPCTL2_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DOEPCTL2_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DOEPCTL2_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DOEPCTL2_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DOEPCTL2_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DOEPCTL2_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DOEPCTL2_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DOEPCTL2_ALTERNATE_SNPM								(0x1u<<20)
#define	OTG_DOEPCTL2_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DOEPCTL2_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DOEPCTL2_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DOEPCTL2_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DOEPCTL2_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DOEPCTL2_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DOEPCTL2_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DOEPCTL2_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DOEPCTL2_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DOEPCTL2_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DOEPCTL2_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DOEPCTL2_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DOEPCTL2_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DOEPCTL2_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DOEPCTL2_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DOEPINT2 Configuration

#define	OTG_DOEPINT2_STPKTRX									(0x1u<<15)
#define	OTG_DOEPINT2_NYET										(0x1u<<14)
#define	OTG_DOEPINT2_NAK										(0x1u<<13)
#define	OTG_DOEPINT2_BERR										(0x1u<<12)
#define	OTG_DOEPINT2_OUTPKTERR									(0x1u<<8)
#define	OTG_DOEPINT2_B2BSTUP									(0x1u<<6)
#define	OTG_DOEPINT2_STSPHSRX									(0x1u<<5)
#define	OTG_DOEPINT2_OTEPDIS									(0x1u<<4)
#define	OTG_DOEPINT2_STUP										(0x1u<<3)
#define	OTG_DOEPINT2_AHBERR										(0x1u<<2)
#define	OTG_DOEPINT2_EPDISD										(0x1u<<1)
#define	OTG_DOEPINT2_XFRC										(0x1u<<0)

// DOEPTSIZ2 Configuration

#define	OTG_DOEPTSIZ2_RXDPID									(0x3u<<29)
#define	OTG_DOEPTSIZ2_RXDPID_0									(0x1u<<29)
#define	OTG_DOEPTSIZ2_PKTCNT									(0x3FFu<<19)
#define	OTG_DOEPTSIZ2_PKTCNT_0									(0x1u<<19)
#define	OTG_DOEPTSIZ2_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DOEPTSIZ2_XFRSIZ_0									(0x1u<<0)

#define	OTG_DOEPTSIZ2_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS	(0x0u<<29)
#define	OTG_DOEPTSIZ2_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS	(0x1u<<29)
#define	OTG_DOEPTSIZ2_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS	(0x2u<<29)
#define	OTG_DOEPTSIZ2_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS	(0x3u<<29)

// DOEPDMA2 Configuration

#define	OTG_DOEPDMA2_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DOEPDMA2_DMAADDR_0									(0x1u<<0)

// DOEPCTL3 Configuration

#define	OTG_DOEPCTL3_EPENA										(0x1u<<31)
#define	OTG_DOEPCTL3_EPDIS										(0x1u<<30)
#define	OTG_DOEPCTL3_SD1PID										(0x1u<<29)
#define	OTG_DOEPCTL3_SD0PID										(0x1u<<28)
#define	OTG_DOEPCTL3_SNAK										(0x1u<<27)
#define	OTG_DOEPCTL3_CNAK										(0x1u<<26)
#define	OTG_DOEPCTL3_STALL										(0x1u<<21)
#define	OTG_DOEPCTL3_SNPM										(0x1u<<20)
#define	OTG_DOEPCTL3_EPTYP										(0x3u<<18)
#define	OTG_DOEPCTL3_EPTYP_0									(0x1u<<18)
#define	OTG_DOEPCTL3_NAKSTS										(0x1u<<17)
#define	OTG_DOEPCTL3_DPID										(0x1u<<16)
#define	OTG_DOEPCTL3_USBAEP										(0x1u<<15)
#define	OTG_DOEPCTL3_MPSIZ										(0x7FFu<<0)
#define	OTG_DOEPCTL3_MPSIZ_0									(0x1u<<0)

#define	OTG_DOEPCTL3_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DOEPCTL3_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DOEPCTL3_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DOEPCTL3_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DOEPCTL3_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DOEPCTL3_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DOEPCTL3_DPID_B_0X0									(0x0u<<16)
#define	OTG_DOEPCTL3_DPID_B_0X1									(0x1u<<16)

// DOEPCTL3_ALTERNATE Configuration

#define	OTG_DOEPCTL3_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DOEPCTL3_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DOEPCTL3_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DOEPCTL3_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DOEPCTL3_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DOEPCTL3_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DOEPCTL3_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DOEPCTL3_ALTERNATE_SNPM								(0x1u<<20)
#define	OTG_DOEPCTL3_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DOEPCTL3_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DOEPCTL3_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DOEPCTL3_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DOEPCTL3_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DOEPCTL3_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DOEPCTL3_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DOEPCTL3_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DOEPCTL3_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DOEPCTL3_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DOEPCTL3_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DOEPCTL3_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DOEPCTL3_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DOEPCTL3_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DOEPCTL3_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

