hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
// DOEPINT3 Configuration

#define	OTG_DOEPINT3_STPKTRX									(0x1u<<15)
#define	OTG_DOEPINT3_NYET										(0x1u<<14)
#define	OTG_DOEPINT3_NAK										(0x1u<<13)
#define	OTG_DOEPINT3_BERR										(0x1u<<12)
#define	OTG_DOEPINT3_OUTPKTERR									(0x1u<<8)
#define	OTG_DOEPINT3_B2BSTUP									(0x1u<<6)
#define	OTG_DOEPINT3_STSPHSRX									(0x1u<<5)
#define	OTG_DOEPINT3_OTEPDIS									(0x1u<<4)
#define	OTG_DOEPINT3_STUP										(0x1u<<3)
#define	OTG_DOEPINT3_AHBERR										(0x1u<<2)
#define	OTG_DOEPINT3_EPDISD										(0x1u<<1)
#define	OTG_DOEPINT3_XFRC										(0x1u<<0)

// DOEPTSIZ3 Configuration

#define	OTG_DOEPTSIZ3_RXDPID									(0x3u<<29)
#define	OTG_DOEPTSIZ3_RXDPID_0									(0x1u<<29)
#define	OTG_DOEPTSIZ3_PKTCNT									(0x3FFu<<19)
#define	OTG_DOEPTSIZ3_PKTCNT_0									(0x1u<<19)
#define	OTG_DOEPTSIZ3_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DOEPTSIZ3_XFRSIZ_0									(0x1u<<0)

#define	OTG_DOEPTSIZ3_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS	(0x0u<<29)
#define	OTG_DOEPTSIZ3_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS	(0x1u<<29)
#define	OTG_DOEPTSIZ3_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS	(0x2u<<29)
#define	OTG_DOEPTSIZ3_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS	(0x3u<<29)

// DOEPDMA3 Configuration

#define	OTG_DOEPDMA3_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DOEPDMA3_DMAADDR_0									(0x1u<<0)

// DOEPCTL4 Configuration

#define	OTG_DOEPCTL4_EPENA										(0x1u<<31)
#define	OTG_DOEPCTL4_EPDIS										(0x1u<<30)
#define	OTG_DOEPCTL4_SD1PID										(0x1u<<29)
#define	OTG_DOEPCTL4_SD0PID										(0x1u<<28)
#define	OTG_DOEPCTL4_SNAK										(0x1u<<27)
#define	OTG_DOEPCTL4_CNAK										(0x1u<<26)
#define	OTG_DOEPCTL4_STALL										(0x1u<<21)
#define	OTG_DOEPCTL4_SNPM										(0x1u<<20)
#define	OTG_DOEPCTL4_EPTYP										(0x3u<<18)
#define	OTG_DOEPCTL4_EPTYP_0									(0x1u<<18)
#define	OTG_DOEPCTL4_NAKSTS										(0x1u<<17)
#define	OTG_DOEPCTL4_DPID										(0x1u<<16)
#define	OTG_DOEPCTL4_USBAEP										(0x1u<<15)
#define	OTG_DOEPCTL4_MPSIZ										(0x7FFu<<0)
#define	OTG_DOEPCTL4_MPSIZ_0									(0x1u<<0)

#define	OTG_DOEPCTL4_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DOEPCTL4_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DOEPCTL4_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DOEPCTL4_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DOEPCTL4_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DOEPCTL4_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DOEPCTL4_DPID_B_0X0									(0x0u<<16)
#define	OTG_DOEPCTL4_DPID_B_0X1									(0x1u<<16)

// DOEPCTL4_ALTERNATE Configuration

#define	OTG_DOEPCTL4_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DOEPCTL4_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DOEPCTL4_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DOEPCTL4_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DOEPCTL4_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DOEPCTL4_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DOEPCTL4_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DOEPCTL4_ALTERNATE_SNPM								(0x1u<<20)
#define	OTG_DOEPCTL4_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DOEPCTL4_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DOEPCTL4_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DOEPCTL4_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DOEPCTL4_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DOEPCTL4_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DOEPCTL4_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DOEPCTL4_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DOEPCTL4_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DOEPCTL4_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DOEPCTL4_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DOEPCTL4_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DOEPCTL4_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DOEPCTL4_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DOEPCTL4_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DOEPINT4 Configuration

#define	OTG_DOEPINT4_STPKTRX									(0x1u<<15)
#define	OTG_DOEPINT4_NYET										(0x1u<<14)
#define	OTG_DOEPINT4_NAK										(0x1u<<13)
#define	OTG_DOEPINT4_BERR										(0x1u<<12)
#define	OTG_DOEPINT4_OUTPKTERR									(0x1u<<8)
#define	OTG_DOEPINT4_B2BSTUP									(0x1u<<6)
#define	OTG_DOEPINT4_STSPHSRX									(0x1u<<5)
#define	OTG_DOEPINT4_OTEPDIS									(0x1u<<4)
#define	OTG_DOEPINT4_STUP										(0x1u<<3)
#define	OTG_DOEPINT4_AHBERR										(0x1u<<2)
#define	OTG_DOEPINT4_EPDISD										(0x1u<<1)
#define	OTG_DOEPINT4_XFRC										(0x1u<<0)

// DOEPTSIZ4 Configuration

#define	OTG_DOEPTSIZ4_RXDPID									(0x3u<<29)
#define	OTG_DOEPTSIZ4_RXDPID_0									(0x1u<<29)
#define	OTG_DOEPTSIZ4_PKTCNT									(0x3FFu<<19)
#define	OTG_DOEPTSIZ4_PKTCNT_0									(0x1u<<19)
#define	OTG_DOEPTSIZ4_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DOEPTSIZ4_XFRSIZ_0									(0x1u<<0)

#define	OTG_DOEPTSIZ4_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS	(0x0u<<29)
#define	OTG_DOEPTSIZ4_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS	(0x1u<<29)
#define	OTG_DOEPTSIZ4_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS	(0x2u<<29)
#define	OTG_DOEPTSIZ4_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS	(0x3u<<29)

// DOEPDMA4 Configuration

#define	OTG_DOEPDMA4_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DOEPDMA4_DMAADDR_0									(0x1u<<0)

// DOEPCTL5 Configuration

#define	OTG_DOEPCTL5_EPENA										(0x1u<<31)
#define	OTG_DOEPCTL5_EPDIS										(0x1u<<30)
#define	OTG_DOEPCTL5_SD1PID										(0x1u<<29)
#define	OTG_DOEPCTL5_SD0PID										(0x1u<<28)
#define	OTG_DOEPCTL5_SNAK										(0x1u<<27)
#define	OTG_DOEPCTL5_CNAK										(0x1u<<26)
#define	OTG_DOEPCTL5_STALL										(0x1u<<21)
#define	OTG_DOEPCTL5_SNPM										(0x1u<<20)
#define	OTG_DOEPCTL5_EPTYP										(0x3u<<18)
#define	OTG_DOEPCTL5_EPTYP_0									(0x1u<<18)
#define	OTG_DOEPCTL5_NAKSTS										(0x1u<<17)
#define	OTG_DOEPCTL5_DPID										(0x1u<<16)
#define	OTG_DOEPCTL5_USBAEP										(0x1u<<15)
#define	OTG_DOEPCTL5_MPSIZ										(0x7FFu<<0)
#define	OTG_DOEPCTL5_MPSIZ_0									(0x1u<<0)

#define	OTG_DOEPCTL5_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DOEPCTL5_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DOEPCTL5_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DOEPCTL5_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DOEPCTL5_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DOEPCTL5_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DOEPCTL5_DPID_B_0X0									(0x0u<<16)
#define	OTG_DOEPCTL5_DPID_B_0X1									(0x1u<<16)

// DOEPCTL5_ALTERNATE Configuration

