hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
#define	OTG_DOEPCTL5_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DOEPCTL5_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DOEPCTL5_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DOEPCTL5_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DOEPCTL5_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DOEPCTL5_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DOEPCTL5_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DOEPCTL5_ALTERNATE_SNPM								(0x1u<<20)
#define	OTG_DOEPCTL5_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DOEPCTL5_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DOEPCTL5_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DOEPCTL5_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DOEPCTL5_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DOEPCTL5_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DOEPCTL5_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DOEPCTL5_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DOEPCTL5_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DOEPCTL5_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DOEPCTL5_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DOEPCTL5_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DOEPCTL5_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DOEPCTL5_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DOEPCTL5_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DOEPINT5 Configuration

#define	OTG_DOEPINT5_STPKTRX									(0x1u<<15)
#define	OTG_DOEPINT5_NYET										(0x1u<<14)
#define	OTG_DOEPINT5_NAK										(0x1u<<13)
#define	OTG_DOEPINT5_BERR										(0x1u<<12)
#define	OTG_DOEPINT5_OUTPKTERR									(0x1u<<8)
#define	OTG_DOEPINT5_B2BSTUP									(0x1u<<6)
#define	OTG_DOEPINT5_STSPHSRX									(0x1u<<5)
#define	OTG_DOEPINT5_OTEPDIS									(0x1u<<4)
#define	OTG_DOEPINT5_STUP										(0x1u<<3)
#define	OTG_DOEPINT5_AHBERR										(0x1u<<2)
#define	OTG_DOEPINT5_EPDISD										(0x1u<<1)
#define	OTG_DOEPINT5_XFRC										(0x1u<<0)

// DOEPTSIZ5 Configuration

#define	OTG_DOEPTSIZ5_RXDPID									(0x3u<<29)
#define	OTG_DOEPTSIZ5_RXDPID_0									(0x1u<<29)
#define	OTG_DOEPTSIZ5_PKTCNT									(0x3FFu<<19)
#define	OTG_DOEPTSIZ5_PKTCNT_0									(0x1u<<19)
#define	OTG_DOEPTSIZ5_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DOEPTSIZ5_XFRSIZ_0									(0x1u<<0)

#define	OTG_DOEPTSIZ5_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS	(0x0u<<29)
#define	OTG_DOEPTSIZ5_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS	(0x1u<<29)
#define	OTG_DOEPTSIZ5_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS	(0x2u<<29)
#define	OTG_DOEPTSIZ5_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS	(0x3u<<29)

// DOEPDMA5 Configuration

#define	OTG_DOEPDMA5_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DOEPDMA5_DMAADDR_0									(0x1u<<0)

// DOEPCTL6 Configuration

#define	OTG_DOEPCTL6_EPENA										(0x1u<<31)
#define	OTG_DOEPCTL6_EPDIS										(0x1u<<30)
#define	OTG_DOEPCTL6_SD1PID										(0x1u<<29)
#define	OTG_DOEPCTL6_SD0PID										(0x1u<<28)
#define	OTG_DOEPCTL6_SNAK										(0x1u<<27)
#define	OTG_DOEPCTL6_CNAK										(0x1u<<26)
#define	OTG_DOEPCTL6_STALL										(0x1u<<21)
#define	OTG_DOEPCTL6_SNPM										(0x1u<<20)
#define	OTG_DOEPCTL6_EPTYP										(0x3u<<18)
#define	OTG_DOEPCTL6_EPTYP_0									(0x1u<<18)
#define	OTG_DOEPCTL6_NAKSTS										(0x1u<<17)
#define	OTG_DOEPCTL6_DPID										(0x1u<<16)
#define	OTG_DOEPCTL6_USBAEP										(0x1u<<15)
#define	OTG_DOEPCTL6_MPSIZ										(0x7FFu<<0)
#define	OTG_DOEPCTL6_MPSIZ_0									(0x1u<<0)

#define	OTG_DOEPCTL6_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DOEPCTL6_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DOEPCTL6_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DOEPCTL6_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DOEPCTL6_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DOEPCTL6_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DOEPCTL6_DPID_B_0X0									(0x0u<<16)
#define	OTG_DOEPCTL6_DPID_B_0X1									(0x1u<<16)

// DOEPCTL6_ALTERNATE Configuration

#define	OTG_DOEPCTL6_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DOEPCTL6_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DOEPCTL6_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DOEPCTL6_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DOEPCTL6_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DOEPCTL6_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DOEPCTL6_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DOEPCTL6_ALTERNATE_SNPM								(0x1u<<20)
#define	OTG_DOEPCTL6_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DOEPCTL6_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DOEPCTL6_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DOEPCTL6_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DOEPCTL6_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DOEPCTL6_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DOEPCTL6_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DOEPCTL6_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DOEPCTL6_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DOEPCTL6_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DOEPCTL6_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DOEPCTL6_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DOEPCTL6_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DOEPCTL6_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DOEPCTL6_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DOEPINT6 Configuration

#define	OTG_DOEPINT6_STPKTRX									(0x1u<<15)
#define	OTG_DOEPINT6_NYET										(0x1u<<14)
#define	OTG_DOEPINT6_NAK										(0x1u<<13)
#define	OTG_DOEPINT6_BERR										(0x1u<<12)
#define	OTG_DOEPINT6_OUTPKTERR									(0x1u<<8)
#define	OTG_DOEPINT6_B2BSTUP									(0x1u<<6)
#define	OTG_DOEPINT6_STSPHSRX									(0x1u<<5)
#define	OTG_DOEPINT6_OTEPDIS									(0x1u<<4)
#define	OTG_DOEPINT6_STUP										(0x1u<<3)
#define	OTG_DOEPINT6_AHBERR										(0x1u<<2)
#define	OTG_DOEPINT6_EPDISD										(0x1u<<1)
#define	OTG_DOEPINT6_XFRC										(0x1u<<0)

// DOEPTSIZ6 Configuration

#define	OTG_DOEPTSIZ6_RXDPID									(0x3u<<29)
#define	OTG_DOEPTSIZ6_RXDPID_0									(0x1u<<29)
#define	OTG_DOEPTSIZ6_PKTCNT									(0x3FFu<<19)
#define	OTG_DOEPTSIZ6_PKTCNT_0									(0x1u<<19)
#define	OTG_DOEPTSIZ6_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DOEPTSIZ6_XFRSIZ_0									(0x1u<<0)

#define	OTG_DOEPTSIZ6_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS	(0x0u<<29)
#define	OTG_DOEPTSIZ6_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS	(0x1u<<29)
#define	OTG_DOEPTSIZ6_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS	(0x2u<<29)
#define	OTG_DOEPTSIZ6_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS	(0x3u<<29)

