hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
// DOEPDMA6 Configuration

#define	OTG_DOEPDMA6_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DOEPDMA6_DMAADDR_0									(0x1u<<0)

// DOEPCTL7 Configuration

#define	OTG_DOEPCTL7_EPENA										(0x1u<<31)
#define	OTG_DOEPCTL7_EPDIS										(0x1u<<30)
#define	OTG_DOEPCTL7_SD1PID										(0x1u<<29)
#define	OTG_DOEPCTL7_SD0PID										(0x1u<<28)
#define	OTG_DOEPCTL7_SNAK										(0x1u<<27)
#define	OTG_DOEPCTL7_CNAK										(0x1u<<26)
#define	OTG_DOEPCTL7_STALL										(0x1u<<21)
#define	OTG_DOEPCTL7_SNPM										(0x1u<<20)
#define	OTG_DOEPCTL7_EPTYP										(0x3u<<18)
#define	OTG_DOEPCTL7_EPTYP_0									(0x1u<<18)
#define	OTG_DOEPCTL7_NAKSTS										(0x1u<<17)
#define	OTG_DOEPCTL7_DPID										(0x1u<<16)
#define	OTG_DOEPCTL7_USBAEP										(0x1u<<15)
#define	OTG_DOEPCTL7_MPSIZ										(0x7FFu<<0)
#define	OTG_DOEPCTL7_MPSIZ_0									(0x1u<<0)

#define	OTG_DOEPCTL7_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DOEPCTL7_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DOEPCTL7_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DOEPCTL7_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DOEPCTL7_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DOEPCTL7_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DOEPCTL7_DPID_B_0X0									(0x0u<<16)
#define	OTG_DOEPCTL7_DPID_B_0X1									(0x1u<<16)

// DOEPCTL7_ALTERNATE Configuration

#define	OTG_DOEPCTL7_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DOEPCTL7_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DOEPCTL7_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DOEPCTL7_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DOEPCTL7_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DOEPCTL7_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DOEPCTL7_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DOEPCTL7_ALTERNATE_SNPM								(0x1u<<20)
#define	OTG_DOEPCTL7_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DOEPCTL7_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DOEPCTL7_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DOEPCTL7_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DOEPCTL7_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DOEPCTL7_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DOEPCTL7_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DOEPCTL7_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DOEPCTL7_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DOEPCTL7_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DOEPCTL7_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DOEPCTL7_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DOEPCTL7_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DOEPCTL7_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DOEPCTL7_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DOEPINT7 Configuration

#define	OTG_DOEPINT7_STPKTRX									(0x1u<<15)
#define	OTG_DOEPINT7_NYET										(0x1u<<14)
#define	OTG_DOEPINT7_NAK										(0x1u<<13)
#define	OTG_DOEPINT7_BERR										(0x1u<<12)
#define	OTG_DOEPINT7_OUTPKTERR									(0x1u<<8)
#define	OTG_DOEPINT7_B2BSTUP									(0x1u<<6)
#define	OTG_DOEPINT7_STSPHSRX									(0x1u<<5)
#define	OTG_DOEPINT7_OTEPDIS									(0x1u<<4)
#define	OTG_DOEPINT7_STUP										(0x1u<<3)
#define	OTG_DOEPINT7_AHBERR										(0x1u<<2)
#define	OTG_DOEPINT7_EPDISD										(0x1u<<1)
#define	OTG_DOEPINT7_XFRC										(0x1u<<0)

// DOEPTSIZ7 Configuration

#define	OTG_DOEPTSIZ7_RXDPID									(0x3u<<29)
#define	OTG_DOEPTSIZ7_RXDPID_0									(0x1u<<29)
#define	OTG_DOEPTSIZ7_PKTCNT									(0x3FFu<<19)
#define	OTG_DOEPTSIZ7_PKTCNT_0									(0x1u<<19)
#define	OTG_DOEPTSIZ7_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DOEPTSIZ7_XFRSIZ_0									(0x1u<<0)

#define	OTG_DOEPTSIZ7_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS	(0x0u<<29)
#define	OTG_DOEPTSIZ7_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS	(0x1u<<29)
#define	OTG_DOEPTSIZ7_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS	(0x2u<<29)
#define	OTG_DOEPTSIZ7_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS	(0x3u<<29)

// DOEPDMA7 Configuration

#define	OTG_DOEPDMA7_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DOEPDMA7_DMAADDR_0									(0x1u<<0)

// DOEPCTL8 Configuration

#define	OTG_DOEPCTL8_EPENA										(0x1u<<31)
#define	OTG_DOEPCTL8_EPDIS										(0x1u<<30)
#define	OTG_DOEPCTL8_SD1PID										(0x1u<<29)
#define	OTG_DOEPCTL8_SD0PID										(0x1u<<28)
#define	OTG_DOEPCTL8_SNAK										(0x1u<<27)
#define	OTG_DOEPCTL8_CNAK										(0x1u<<26)
#define	OTG_DOEPCTL8_STALL										(0x1u<<21)
#define	OTG_DOEPCTL8_SNPM										(0x1u<<20)
#define	OTG_DOEPCTL8_EPTYP										(0x3u<<18)
#define	OTG_DOEPCTL8_EPTYP_0									(0x1u<<18)
#define	OTG_DOEPCTL8_NAKSTS										(0x1u<<17)
#define	OTG_DOEPCTL8_DPID										(0x1u<<16)
#define	OTG_DOEPCTL8_USBAEP										(0x1u<<15)
#define	OTG_DOEPCTL8_MPSIZ										(0x7FFu<<0)
#define	OTG_DOEPCTL8_MPSIZ_0									(0x1u<<0)

#define	OTG_DOEPCTL8_EPTYP_B_0X0								(0x0u<<18)
#define	OTG_DOEPCTL8_EPTYP_B_0X1								(0x1u<<18)
#define	OTG_DOEPCTL8_EPTYP_B_0X2								(0x2u<<18)
#define	OTG_DOEPCTL8_EPTYP_B_0X3								(0x3u<<18)
#define	OTG_DOEPCTL8_NAKSTS_B_0X0								(0x0u<<17)
#define	OTG_DOEPCTL8_NAKSTS_B_0X1								(0x1u<<17)
#define	OTG_DOEPCTL8_DPID_B_0X0									(0x0u<<16)
#define	OTG_DOEPCTL8_DPID_B_0X1									(0x1u<<16)

// DOEPCTL8_ALTERNATE Configuration

#define	OTG_DOEPCTL8_ALTERNATE_EPENA							(0x1u<<31)
#define	OTG_DOEPCTL8_ALTERNATE_EPDIS							(0x1u<<30)
#define	OTG_DOEPCTL8_ALTERNATE_SODDFRM							(0x1u<<29)
#define	OTG_DOEPCTL8_ALTERNATE_SEVNFRM							(0x1u<<28)
#define	OTG_DOEPCTL8_ALTERNATE_SNAK								(0x1u<<27)
#define	OTG_DOEPCTL8_ALTERNATE_CNAK								(0x1u<<26)
#define	OTG_DOEPCTL8_ALTERNATE_STALL							(0x1u<<21)
#define	OTG_DOEPCTL8_ALTERNATE_SNPM								(0x1u<<20)
#define	OTG_DOEPCTL8_ALTERNATE_EPTYP							(0x3u<<18)
#define	OTG_DOEPCTL8_ALTERNATE_EPTYP_0							(0x1u<<18)
#define	OTG_DOEPCTL8_ALTERNATE_NAKSTS							(0x1u<<17)
#define	OTG_DOEPCTL8_ALTERNATE_EONUM							(0x1u<<16)
#define	OTG_DOEPCTL8_ALTERNATE_USBAEP							(0x1u<<15)
#define	OTG_DOEPCTL8_ALTERNATE_MPSIZ							(0x7FFu<<0)
#define	OTG_DOEPCTL8_ALTERNATE_MPSIZ_0							(0x1u<<0)

#define	OTG_DOEPCTL8_ALTERNATE_EPTYP_B_0X0						(0x0u<<18)
#define	OTG_DOEPCTL8_ALTERNATE_EPTYP_B_0X1						(0x1u<<18)
#define	OTG_DOEPCTL8_ALTERNATE_EPTYP_B_0X2						(0x2u<<18)
#define	OTG_DOEPCTL8_ALTERNATE_EPTYP_B_0X3						(0x3u<<18)
#define	OTG_DOEPCTL8_ALTERNATE_NAKSTS_B_0X0						(0x0u<<17)
#define	OTG_DOEPCTL8_ALTERNATE_NAKSTS_B_0X1						(0x1u<<17)
#define	OTG_DOEPCTL8_ALTERNATE_EONUM_B_0X0						(0x0u<<16)
#define	OTG_DOEPCTL8_ALTERNATE_EONUM_B_0X1						(0x1u<<16)

// DOEPINT8 Configuration

