hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_otg.h
#define	OTG_DOEPINT8_STPKTRX									(0x1u<<15)
#define	OTG_DOEPINT8_NYET										(0x1u<<14)
#define	OTG_DOEPINT8_NAK										(0x1u<<13)
#define	OTG_DOEPINT8_BERR										(0x1u<<12)
#define	OTG_DOEPINT8_OUTPKTERR									(0x1u<<8)
#define	OTG_DOEPINT8_B2BSTUP									(0x1u<<6)
#define	OTG_DOEPINT8_STSPHSRX									(0x1u<<5)
#define	OTG_DOEPINT8_OTEPDIS									(0x1u<<4)
#define	OTG_DOEPINT8_STUP										(0x1u<<3)
#define	OTG_DOEPINT8_AHBERR										(0x1u<<2)
#define	OTG_DOEPINT8_EPDISD										(0x1u<<1)
#define	OTG_DOEPINT8_XFRC										(0x1u<<0)

// DOEPTSIZ8 Configuration

#define	OTG_DOEPTSIZ8_RXDPID									(0x3u<<29)
#define	OTG_DOEPTSIZ8_RXDPID_0									(0x1u<<29)
#define	OTG_DOEPTSIZ8_PKTCNT									(0x3FFu<<19)
#define	OTG_DOEPTSIZ8_PKTCNT_0									(0x1u<<19)
#define	OTG_DOEPTSIZ8_XFRSIZ									(0x7FFFFu<<0)
#define	OTG_DOEPTSIZ8_XFRSIZ_0									(0x1u<<0)

#define	OTG_DOEPTSIZ8_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS	(0x0u<<29)
#define	OTG_DOEPTSIZ8_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS	(0x1u<<29)
#define	OTG_DOEPTSIZ8_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS	(0x2u<<29)
#define	OTG_DOEPTSIZ8_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS	(0x3u<<29)

// DOEPDMA8 Configuration

#define	OTG_DOEPDMA8_DMAADDR									(0xFFFFFFFFu<<0)
#define	OTG_DOEPDMA8_DMAADDR_0									(0x1u<<0)

// PCGCCTL Configuration

#define	OTG_PCGCCTL_SUSP										(0x1u<<7)
#define	OTG_PCGCCTL_PHYSLEEP									(0x1u<<6)
#define	OTG_PCGCCTL_ENL1GTG										(0x1u<<5)
#define	OTG_PCGCCTL_PHYSUSP										(0x1u<<4)
#define	OTG_PCGCCTL_GATEHCLK									(0x1u<<1)
#define	OTG_PCGCCTL_STPPCLK										(0x1u<<0)

// PCGCCTL1 Configuration

#define	OTG_PCGCCTL1_RAMGATEEN									(0x1u<<3)
#define	OTG_PCGCCTL1_CNTGATECLK									(0x3u<<1)
#define	OTG_PCGCCTL1_CNTGATECLK_0								(0x1u<<1)
#define	OTG_PCGCCTL1_GATEEN										(0x1u<<0)

#define	OTG_PCGCCTL1_CNTGATECLK_B_0X0							(0x0u<<1)
#define	OTG_PCGCCTL1_CNTGATECLK_B_0X1							(0x1u<<1)
